package com.nakhl.behtarinentekhab.activity;

import java.util.List;

import roboguice.inject.InjectView;
import android.R.drawable;
import android.annotation.TargetApi;
import android.app.ActionBar;
import android.app.AlertDialog;
import android.app.Dialog;
import android.content.DialogInterface;
import android.content.Intent;
import android.net.Uri;
import android.os.Build;
import android.os.Bundle;
import android.support.v4.app.FragmentTabHost;
import android.support.v4.view.ViewPager;
import android.text.method.MovementMethod;
import android.text.method.ScrollingMovementMethod;
import android.util.Log;
import android.view.Gravity;
import android.view.KeyEvent;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.view.MotionEvent;
import android.view.View;
import android.view.View.OnClickListener;
import android.view.Window;
import android.widget.Button;
import android.widget.LinearLayout;
import android.widget.TabHost;
import android.widget.TextView;
import android.widget.Toast;

import com.google.inject.Inject;
import com.nakhl.behtarinentekhab.R;
import com.nakhl.behtarinentekhab.accordion.utils.FontUtils;
import com.nakhl.behtarinentekhab.accordion.widget.AccordionView;
import com.nakhl.behtarinentekhab.model.dao.JobDao;
import com.nakhl.behtarinentekhab.model.dao.LevelDao;
import com.nakhl.behtarinentekhab.model.entity.Exercise;
import com.nakhl.behtarinentekhab.model.entity.Job;
import com.nakhl.behtarinentekhab.model.entity.Level;
import com.nakhl.behtarinentekhab.model.entity.Model1;

/**
 * Model1Level activity.
 * 
 * @author Ahmad khalilfar
 * 
 */
public class Model2LevelsActivity extends FullScreenActivity {

	@InjectView(R.id.buttonExplain)
	private Button buttonExplain;

	@InjectView(R.id.buttonTests)
	private Button buttonTests;

	@InjectView(R.id.buttonResult)
	private Button buttonResult;

	@Inject
	private LevelDao levelDao;

	@Inject
	private JobDao jobDao;

	String message = "لطفا مراحل قبل را کامل کنید...";

	/*
	 * (non-Javadoc)
	 * 
	 * @see android.app.Activity#onCreate(android.os.Bundle)
	 */
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.activity_model2_levels);
		initButtons();
	}

	/* Menu */
	@Override
	public boolean onCreateOptionsMenu(Menu menu) {
		MenuInflater inflater = getMenuInflater();
		inflater.inflate(R.menu.main, menu);
		return true;
	}

	@Override
	public boolean onOptionsItemSelected(MenuItem item) {

		return super.onOptionsItemSelected(item);
	}

	/**
	 * Initialize buttons.
	 */
	private void initButtons() {

		buttonExplain.setOnClickListener(new OnClickListener() {

			@Override
			public void onClick(View v) {

				showExplainDialog();
			}
		});

		buttonTests.setOnClickListener(new OnClickListener() {

			@Override
			public void onClick(View v) {
				Bundle b = new Bundle();
				b.putInt("type", 4);
				b.putInt("sub", 0);

				Intent intent = new Intent(getApplicationContext(),
						LevelsActivity.class);
				intent.putExtras(b);

				startActivity(intent);
			}
		});

		buttonResult.setOnClickListener(new OnClickListener() {

			@Override
			public void onClick(View v) {

				Level level;
				boolean isCompleted = true;
				for (int i = 0; i < 4; i++) {
					level = levelDao.queryForId(60 + i);
					if (level.getScore() == -1) {
						isCompleted = false;
						break;
					}
				}
				if (isCompleted) {

					Intent intent = new Intent(getApplicationContext(),
							Model2ResultActivity.class);
					startActivity(intent);

				} else {
					Toast.makeText(getApplicationContext(), message,
							Toast.LENGTH_SHORT).show();
				}

			}
		});

	}

	private void showExplainDialog() {

		/* Explain model 2 test */
		String ExplainText = "یکی از معتبرترین، مطمئن ترین و درست ترین تست خودشناسی و تست شخصیت شناسی در دنیا، تست شخصیت شناسی MBTI است.";
		ExplainText += "\n" + "چه کسانی تست MBTI  را ایجاد کردند؟";
		ExplainText += "\n"
				+ "تست شخصیتMBTI بر مبنای نتایج تحقیقات روانشناس مشهور سوئیسی، یونگ، شکل گرفت. کارل یونگ معتقد بود اگر بتوان زیربنای ذهنی، برداشت ها و نگرش های اشخاص را شناخت، می توان رفتارهای آنها را پیش بینی کرد. او در این خصوص نظریات ارزشمندی را ارائه کرد.";
		ExplainText += "\n"
				+ "سال ها بعد دو دانشمند دیگر به نام های بریگز و مایرز با استفاده از نظرات و نتایج تحقیقات یونگ و انجام برخی پژوهش ها در حوزه شخصیت شناسی، تست شخصیت MBTI را طراحی کردند. آنها چهار بعد (ترجیح) شخصیتی و شانزده تیپ شخصیتی را در افراد شناسایی کردند. به عبارتی آنها همه افراد روی زمین را در 16 تیپ شخصیتی دسته بندی کردند که بر اساس تست MBTI می توان به تیپ شخصیتی آنها پی برد. ترجیحات شخصیتی، ویژگی هایی در افراد هستند که برای آنها راحت تر و بهتر بوده و انجام شان نیاز به تمرکز، صرف انرژی و زمان کمتری دارد. به عنوان مثال فردی که ترجیح برون گرایی دارد، وقتی در جمع بوده، با افراد دیگر در ارتباط و در کانون توجه است، احساس بهتری دارد و انرژی بیشتری می گیرد. در ضمن برقراری ارتباط  با دیگران برای او کاری آسان، بدون زحمت و لذت بخش است. ";
		ExplainText += "\n"
				+ "چهار بعد (ترجیح) شخصیتی شناخته شده توسط این دانشمندان عبارتند از :";
		ExplainText += "\n"
				+ ">> درون گرا - (I) برون گرا :(E) این بعد بر مبنای چگونگی برخورد و تعامل ما با دنیا و  اینکه انرژی مان را متوجه کجا می کنیم و از کجا انرژی می گیریم، تعریف شده است.";
		ExplainText += "\n"
				+ ">> شمی - (N) حسی :(S) اینکه اغلب به چه نوع اطلاعاتی توجه می کنیم و  چگونه آنها را بدست می آوریم، این بعد را مشخص می کند.";
		ExplainText += "\n"
				+ ">> احساسی - (F) فکری :(T) بر اینکه چگونه اطلاعات خود را پردازش می کنیم و چگونه تصمیم می گیریم، دلالت دارد.";
		ExplainText += "\n"
				+ ">> ملاحظه کننده - (P) داوری کننده :(J) اینکه ما ترجیح می دهیم در شرایط سازمان یافته و با ساختار فعالیت کنیم یا استقلال بیشتری داشته باشیم، تعیین کننده این بعد است.";

		ExplainText += "\n\n" + "ویژگی های افراد با هر بعد (ترجیح) شخصیتی:";

		ExplainText += "\n" + ">> درون گراها(I)";
		ExplainText += "\n"
				+ " - افرادی محافظه کار، مستقل، تکرو، خجالتی، خوددار، یکنواخت و متعادل و  کمرو هستند.";
		ExplainText += "\n" + " - از درون خود انرژی می گیرند.";
		ExplainText += "\n" + " - موضوعات را در ذهن خود ارزیابی می کنند.";
		ExplainText += "\n"
				+ " - اطلاعات شخصی را به ندرت با دیگران در میان می گذارند.";
		ExplainText += "\n" + " - بیشتر گوش می دهند و کمتر حرف می زنند.";
		ExplainText += "\n" + " - اشتیاقشان را برای خود نگه می دارند.";
		ExplainText += "\n" + " - دوست ندارند مرکز توجه باشند.";
		ExplainText += "\n" + " - قبل از هر عملی فکر می کنند.";

		ExplainText += "\n" + ">> برون گراها(E)";
		ExplainText += "\n"
				+ " - برون گراها افرادی اجتماعی، دوستدار دیگران، باجرأت، فعال، سرخوش، با انرژی، خوشبین، دوستدار هیجان و تحریک و امیدوار به موقعیت هایشان و آینده، کنجکاو و در عمل قاطع، فعال و اهل گفتگو هستند.";
		ExplainText += "\n" + " - از دیگران انرژی می گیرند.";
		ExplainText += "\n" + " - با صدای بلند فکر می کنند.";
		ExplainText += "\n" + " - دوست دارند مرکز توجه باشند.";
		ExplainText += "\n"
				+ " - اطلاعات شخصی خود را به راحتی با دیگران در میان می گذارند.";
		ExplainText += "\n" + " - اول عمل و بعد فکر می کنند.";
		ExplainText += "\n" + " - بیشتر از گوش دادن، حرف می زنند.";
		ExplainText += "\n" + " - مشتاقانه با دیگران ارتباط برقرار می کنند.";

		ExplainText += "\n" + ">> شمی ها(N)";
		ExplainText += "\n"
				+ " -  ترجیح می دهند با دیدن \" تصویر بزرگ از آنچه هست\" و تمرکز بر پیوندها و ارتباطات موجود میان حقایق، اطلاعات را درک کنند.";
		ExplainText += "\n"
				+ " -  ترجیح می دهند با درک و دیدن امکانات جدید ( خلاقیت ) و روش های مختلف  انجام کارها، اطلاعات را جمع آوری کنند.";
		ExplainText += "\n"
				+ " - دوستدار ایده های جدید( بدون توجه به قابل اجرا بودن یا نبودن) بوده و عاشق  نوآوری و تخیل اند.";
		ExplainText += "\n" + " - برای نوآوری و تخیل بهای فراوان قائل هستند.";
		ExplainText += "\n" + " - دوست دارند مهارت های جدید را بیاموزند.";
		ExplainText += "\n" + " - به اطلاعات دقیق توجه ندارند.";
		ExplainText += "\n" + " - به آینده توجه دارند.";

		ExplainText += "\n" + ">> حسی ها(S)";
		ExplainText += "\n"
				+ " - ترجیح می دهند با استفاده از چشم و گوش و دیگر حواس پنجگانه به آنچه که در  اطرافشان می گذرد پی ببرند.";
		ExplainText += "\n"
				+ " - به هر آنچه که در اطرافشان وجود دارد، توجه می کنند و آن را به خوبی درک می کنند.";
		ExplainText += "\n"
				+ " - به آنچه که مطمئن و منسجم است، اعتماد می کنند.";
		ExplainText += "\n"
				+ " - تنها در صورت قابل اجرا بودن، از ایده های جدید استقبال می کنند.";
		ExplainText += "\n" + " - واقع گرا هستند.";
		ExplainText += "\n" + " - دوست دارند از مهارت های موجود استفاده کنند.";
		ExplainText += "\n" + " - به زمان حاضر توجه دارند.";

		ExplainText += "\n" + ">> احساسی ها(F)";
		ExplainText += "\n" + " - به احساسات دیگران توجه می کنند.";
		ExplainText += "\n"
				+ " - نیازها و ارزش ها را درک می کنندو احساساتشان را نشان می دهند.";
		ExplainText += "\n"
				+ " - تحت تاثیر میل به قدردانی شدن، انگیزه پیدا می کنند.";
		ExplainText += "\n"
				+ " - به طور طبیعی علاقه به راضی کردن دیگران دارند.";
		ExplainText += "\n"
				+ " - ممکن است بیش از اندازه احساسی و عاطفی ارزیابی شوند.";
		ExplainText += "\n" + " - به ادب بیش از حقیقت بها می دهند.";
		ExplainText += "\n" + " - برای هر احساسی ارزش قائل اند.";

		ExplainText += "\n" + ">> فکری ها(T)";
		ExplainText += "\n"
				+ " - در تصمیم گیری از تفکر استفاده می کنند (به نتایج منطقی انتخاب و عمل توجه دارند).";
		ExplainText += "\n"
				+ " - سعی دارند از لحاظ فکری خود را از یک موقعیت جدا کرده و بی طرفانه و به  شکل عینی آن را آزموده و علت و معلول را تجزیه و تحلیل کنند.";
		ExplainText += "\n"
				+ " - تحت تاثیر میل به موفقیت، انگیزه پیدا می کنند.";
		ExplainText += "\n" + " - در تصمیم گیری، تحلیل های غیر شخصی دارند.";
		ExplainText += "\n" + " - عیب و ایرادها را می بینند و انتقاد می کنند.";
		ExplainText += "\n"
				+ " - ممکن است بی ترحم، بی احساس و بی توجه به حساب آیند.";
		ExplainText += "\n" + " - به حقیقت بیش از ادب بها می دهند.";
		ExplainText += "\n" + " - احساسات را در گرو منطقی بودن می پذیرند.";

		ExplainText += "\n" + ">> ملاحظه کننده ها(P)";
		ExplainText += "\n" + " - قوانین را خودشان تعیین می کنند.";
		ExplainText += "\n"
				+ " - در انجام کارهایی که از قبل پیش بینی نشده یا فعالیت هایی که به سرعت و  واکنش فوری نیاز دارد، موفق هستند.";
		ExplainText += "\n" + " - ترجیح آنها اول لذت بعد کاراست.";
		ExplainText += "\n" + " - زمان را منبعی تمام نشدنی  می دانند.";
		ExplainText += "\n" + " - خود را با موقعیت های جدید تطبیق می دهند.";
		ExplainText += "\n" + " - به چگونگی انجام کار تاکید دارند.";

		ExplainText += "\n" + ">> داوری کننده ها(J)";
		ExplainText += "\n"
				+ " - تابع قانون بوده و بر اساس آن برنامه خودشان را بطور دقیق مشخص می کنند.";
		ExplainText += "\n"
				+ " - بر انجام کارها در سر وقت تعیین شده پافشاری می کنند.";
		ExplainText += "\n"
				+ " - اهدافی را در محل کار برای خود در نظر می گیرند تا به موقع به آنها برسند.";
		ExplainText += "\n" + " - ترجیح آنها اول کار و بعد بازی است.";
		ExplainText += "\n" + " - از اخلاق کاری بالایی برخوردارند.";
		ExplainText += "\n" + " - ترجیح می دهند بدانند که چه می کنند.";

		ExplainText += "\n\n"
				+ "در تست شخصیت شناسی MBTI بر مبنای این چهار بعد، شانزده تیپ شخصیتی زیر تعریف شده است:";
		ExplainText += "\n" + "•	ISTJشخصیت";
		ExplainText += "\n" + "•	ISFJشخصیت";
		ExplainText += "\n" + "•	INFJشخصیت";
		ExplainText += "\n" + "•	INTJشخصیت";
		ExplainText += "\n" + "•	ISTPشخصیت";
		ExplainText += "\n" + "•	ISFPشخصیت";
		ExplainText += "\n" + "•	INFPشخصیت";
		ExplainText += "\n" + "•	INTPشخصیت";
		ExplainText += "\n" + "•	ESTPشخصیت";
		ExplainText += "\n" + "•	ESFPشخصیت";
		ExplainText += "\n" + "•	ENFPشخصیت";
		ExplainText += "\n" + "•	ENTPشخصیت";
		ExplainText += "\n" + "•	ESTJشخصیت";
		ExplainText += "\n" + "•	ESFJشخصیت";
		ExplainText += "\n" + "•	ENFJشخصیت";
		ExplainText += "\n" + "•	ENTJشخصیت";

		ExplainText += "\n\n"
				+ "کاربردهای تست شخصیت شناسی MBTI چه چیزهایی هستند؟";
		ExplainText += "\n" + "•	شناخت خوب افراد از خودشان";
		ExplainText += "\n" + "•	مشاوره ازدواج";
		ExplainText += "\n" + "•	مشاوره تحصیلی";
		ExplainText += "\n" + "•	مشاوره شغلی";
		ExplainText += "\n" + "•	انتخاب و تغییر شغل";
		ExplainText += "\n" + "•	استخدام و جذب نیرو";
		ExplainText += "\n" + "•	حفظ و ایجاد انگیزه در پرسنل";
		ExplainText += "\n" + "•	تغییرات سازمانی";
		ExplainText += "\n" + "•	و بسیاری موارد دیگر";

		ExplainText += "\n\n"
				+ "رشته تحصیلی و شغل از اصلی ترین و مهم ترین بخش های زندگی هر فردی از جمله شماست. توجه ویژه به آن همراه با انجام یک انتخاب درست، باعث رضایت شغلی، آرامش ذهنی و احساس خوب در شما می شود.تست MBTI ابزار بسیار خوب و کمک کننده ای برای شما در این راه است. بعد از زدن پرسشنامه MBTI با ویژگی های شخصیتی، نقاط قوت، نقاط ضعف، مشاغل مناسب خود، محیط کاری و زندگی مطلوب خودتان آشنا می شوید. فراموش نکنید MBTI یک ابزار است که شناخت خوبی به شما می دهد اما برای یک انتخاب درست مثل انتخاب رشته و شغل باید در کنار آن عوامل مختلف دیگری را نیز در نظر بگیرید.";

		/* Structure of model 2 test */

		String StructureText = "آزمون MBTI دارای چهار قسمت و 87 سوال می باشد.";
		StructureText += "\n"
				+ "در هر سوال صرفا یکی از گزینه ها را انتخاب کنید.";
		StructureText += "\n"
				+ "باید به هر سوال بر اساس درک شخصی خود پاسخ دهید.";

		// custom dialog
		final Dialog dialog = new ExplainTabDialog(Model2LevelsActivity.this);
		// dialog.requestWindowFeature(Window.FEATURE_NO_TITLE);
		// dialog.setContentView(R.layout.activity_explain_swipe);
		// dialog.setTitle("Title...");

		// explain
		TextView tvExplain = (TextView) dialog
				.findViewById(R.id.textViewExplain);
		tvExplain.setText(ExplainText);
		tvExplain.setMovementMethod(new ScrollingMovementMethod());

		// structure
		TextView tvStructure = (TextView) dialog
				.findViewById(R.id.textViewStructure);
		tvStructure.setText(StructureText);
		tvStructure.setMovementMethod(new ScrollingMovementMethod());

		// tips

		TextView tv1 = new TextView(Model2LevelsActivity.this);
		tv1.setMovementMethod(new ScrollingMovementMethod());
		tv1.setBackgroundResource(R.drawable.entekhab_textview);
		tv1.setGravity(Gravity.RIGHT);
		//
		TextView tv2 = new TextView(Model2LevelsActivity.this);
		tv2.setMovementMethod(new ScrollingMovementMethod());
		tv2.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv3 = new TextView(Model2LevelsActivity.this);
		tv3.setMovementMethod(new ScrollingMovementMethod());
		tv3.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv4 = new TextView(Model2LevelsActivity.this);
		tv4.setMovementMethod(new ScrollingMovementMethod());
		tv4.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv5 = new TextView(Model2LevelsActivity.this);
		tv5.setMovementMethod(new ScrollingMovementMethod());
		tv5.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv6 = new TextView(Model2LevelsActivity.this);
		tv6.setMovementMethod(new ScrollingMovementMethod());
		tv6.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv7 = new TextView(Model2LevelsActivity.this);
		tv7.setMovementMethod(new ScrollingMovementMethod());
		tv7.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv8 = new TextView(Model2LevelsActivity.this);
		tv8.setMovementMethod(new ScrollingMovementMethod());
		tv8.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv9 = new TextView(Model2LevelsActivity.this);
		tv9.setMovementMethod(new ScrollingMovementMethod());
		tv9.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv10 = new TextView(Model2LevelsActivity.this);
		tv10.setMovementMethod(new ScrollingMovementMethod());
		tv10.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv11 = new TextView(Model2LevelsActivity.this);
		tv11.setMovementMethod(new ScrollingMovementMethod());
		tv11.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv12 = new TextView(Model2LevelsActivity.this);
		tv12.setMovementMethod(new ScrollingMovementMethod());
		tv12.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv13 = new TextView(Model2LevelsActivity.this);
		tv13.setMovementMethod(new ScrollingMovementMethod());
		tv13.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv14 = new TextView(Model2LevelsActivity.this);
		tv14.setMovementMethod(new ScrollingMovementMethod());
		tv14.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv15 = new TextView(Model2LevelsActivity.this);
		tv15.setMovementMethod(new ScrollingMovementMethod());
		tv15.setBackgroundResource(R.drawable.entekhab_textview);
		//
		TextView tv16 = new TextView(Model2LevelsActivity.this);
		tv16.setMovementMethod(new ScrollingMovementMethod());
		tv16.setBackgroundResource(R.drawable.entekhab_textview);
		//

		String temp;
		// accardion menu
		final AccordionView v = (AccordionView) dialog
				.findViewById(R.id.accordion_view);

		// element 1 - ESFJ
		LinearLayout accord_container1 = (LinearLayout) v
				.findViewById(R.id.accord_element1);
		temp = "شخصیت ESFJ که کرسی آنان را پشتیبان (Provider) نامیده، کسانی هستند که تمام تلاششان را می کنند تا سلامت و رفاه افرادی که برایشان اهمیت دارند را برآورده کنند، اما باید گفت که در میان دیگر سنتی ها آنان اجتماعی ترینشان هستند، بنابراین بخش اعظمی از وظیفه خدمت رسانی به مؤسسات اجتماعی نظیر مدارس، کلیساها، باشگاه های اجتماعی و گروه های مدنی را تشکیل می دهند. باید گفت که پشتیبانان حدود ۱۰ درصد از جمعیت جامعه را تشکیل می دهند و البته این برای بقیه دیگر تیپ ها جای خوشبختی است زیرا خدمات اجتماعی مهرورزانه کلیدی ترین خصوصیت شخصیتی آنهاست. آنها هر کجا که بروند با کمال میل و رغبت زمان و انرژی خود را برای برآورده کردن نیازهای دیگران صرف کرده و مطمئناً این کارکرد اجتماعی برای آنان مایه موفقیت خواهد بود.";
		temp += "\n" + "شخصیت  های ESFJ که روحیه تعاون و همکاری بسیار بالایی دارند، در حفظ و نگهداری گروه های کاری مهارت بالایی داشته و از اینکه تمام توجه خود را معطوف ارائه محصولات و خدمات بکنند هیچگاه احساس خستگی نمی کنند. در پذیرفتن مسئولیت برگزاری مهمانی ها، مراسم، گردهمایی ها و جلسات امور خیریه بسیار عالی عمل کرده و قادرند بدون هیچ کمکی همچون اساتید سخنوری به راحتی و با اطمینان بالا در میان جمع به صحبت کردن بپردازند. شایان ذکر است که آنان میزبانان فوق العاده ای هستند که هر کسی را با نام کوچک شناخته و ظاهراً می دانند که هر شخص در حال انجام چه کاری است. پشتیبانان عاشق سرگرم کردن دیگران هستند و همیشه به فکر نیاز مهمانان خود بوده و خواهان آن هستند که همه چیز برای مهمانانشان مهیا باشد.";
		temp += "\n" + "شخصیت  های ESFJ دوست داشتنی، قابل اطمینان، مهربان و در یک کلام مردم دار هستند، آنچنانکه اگر آنها را از مردم جدا کنید به شدت بی طاقت خواهند شد. عاشق حرف زدن با دیگران هستند و در اغلب اوقات به راحتی سر صحبت را با غریبه ها باز می کنند و خیلی راحت و دلپذیر در مورد مسائل مختلف و هر آنچه که به ذهنشان می آید صحبت می کنند.";
		temp += "\n" + "دوستی برای آنها مسأله بسیار مهمی است و اغلب مکالمه ای که سالها پیش با دوستانشان داشته اند خاطرات خوشی را برایشان تداعی می کند. همچنین سنت های خانوادگی برای آنها بسیار مقدس است و همیشه تاریخ تولدها و سالگردها را به خوبی به خاطرشان می سپرند. علاوه بر این زمانی که از دوستان و یا همسایه های خود خبر جدیدی به آنها می رسد با حالت جذاب و قابل توجهی عکس العمل نشان می دهند. اگر ما بخواهیم از اتفاقاتی که در جامعه، محله، مدرسه، یا هر جای دیگری مطلع شویم، آنها با خوشحالی و رغبت هر آنچه را که اتفاق افتاده است با جزئیات کامل به ما خواهند گفت.";
		temp += "\n" + "پشتیبانان نسبت به احساسات دیگران بسیار حساس هستند که همین موضوع شاید باعث شود که آنها در میان دیگر تیپ ها دلسوزترین افراد باشند که البته نکته منفی این امر این است که آنها تاحدی کمرو می شوند و به شدت در مورد این که دیگران در موردشان چه فکر می کنند حساس خواهند شد. آنها افرادی هستند که به دیگران عشق و توجه فراوانی می دهند، ولی در عوض نیاز به این دارند که از سوی دیگران دوست داشته شوند. در حقیقت باید گفت، ESFJ ها به راحتی در مقابل انتقادهای شخصی آسیب های جدی می بینند و زمانی در اوج خوشحالی هستند که هم از خودشان و هم از خدمات بی وقفه ای که به دیگران می دهند مورد ستایش و تقدیر فراوان قرار گیرند.";		
		
		tv1.setText(temp);
		accord_container1.addView(tv1);
		//
		// element 2 - ESTJ
		LinearLayout accord_container2 = (LinearLayout) v
				.findViewById(R.id.accord_element2);
		temp = "شخصیتESTJ  یا سرپرست (Supervisors) به شدت اجتماعی بوده و در محیط مدرسه، کلیسا، صنعت یا گروه های مدنی به مدارج بالای مسئولیتی دست می یابند. سرپرست ها در مورد زمان و انرژی خود سخاوتمند بوده و در اغلب اوقات در باشگاه ها و انجمن ها شرکت کرده و با حضور پیوسته خود آنان را حمایت می کنند، اما نقش یک رهبر رک و راست را نیز به خود می گیرند. سرپرست ها به عهده گرفتن مسئولیت گروهها را دوست داشته و با دستور دادن احساس راحتی بیشتری پیدا می کنند. با مافوق خود همکاری کرده و همچنین انتظار دارند افرادی که تحت امر آنان هستند نیز با آنها همکاری داشته باشند. این کار تعهدهایی به بار می آورد اما برتری ها و فواید مخصوص به خود را نیز دارد.";
		temp += "\n" + "سرپرست ها که حداقل ۱۰ درصد از جمعیت جامعه را تشکیل می دهند، از برنامه ریزی، تدوین دستورجلسات، فهرست اموال و مواردی از این دست لذت می برند. ترجیح اصلی آنان این است که کارها به روال و روش صحیح خود انجام شود تا اینکه از راه های تجربی یا سعی و خطا صورت پذیرد. سرپرست ها هنگام انجام کار محتاطانه عمل می کنند و دوست دارند کسانی که تحت نظارت آنان هستند نیز از همین روش استفاده کنند، خواه کارمندان یا زیردستان آنها باشند ، خواه همسر یا فرزندانشان. سرپرست ها هیچ مشکلی با ارزیابی افراد ندارند و علاقه خاصی به قضاوت کردن در مورد دیگران دارند. آنان این قضاوت را بر اساس احترام گذاشتن و یا رعایت رویه ها و برنامه های زمانبندی شده انجام می دهند.";
		temp += "\n" + "سرپرست ها به طور شگفت انگیزی به شدت کار می کنند. حتی در دوران کودکی، آنها افرادی ماهر و کوشا بوده و معمولا به والدین خود همانند مسئولین رسمی احترام می گذارند. در مدرسه، سرپرست ها دانش آموزانی نمونه بوده، از قوانین به صورت وظیفه شناسانه ای تبعیت می کنند و تمام تکالیف خود را به طور کامل و سر موقع انجام می دهند. مهمتر از همه اینها، آنها هر کاری را که فکر کنند درست است انجام می دهند؛ به ندرت پیش می آید که در مورد تکالیف، روش تدریس، استانداردها و یا اختیارات سؤالی بپرسند. مهارت و پشتکار آنها تنها زمانی اهمیت خود را پیدا می کند که به دوران بزرگسالی قدم گذاشته و مسئولیت یک کار و یا خانواده را بر عهده بگیرند.";
		temp += "\n" + "سرپرست ها با روابط انسانی بر اساس قواعد سنتی برخورد می کنند. ازدواج و وظیفه والدینی برای آنان مقدس است، دوست دارند حلقه گسترده ای از دوستان را در اختیار داشته باشند که سالیان سال و با رابطه دوستی وفادارانه تداوم داشته باشد. گردهمایی ها و جشن های اجتماعی برای آنان معنای مهمی دارد و دائماً به دنبال تعطیلات، مراسم ازدواج، تجدید دیدارهای با همکلاسی های قدیمی و مراسمی از این نوع می باشند. از منظر اجتماعی سرپرست ها افرادی دوست داشتنی هستند که با راحتی با دیگران به صحبت می نشینند. اگرچه رفتار آنها شاید کمی رسمی باشد، اما در کل افرادی هستند که به راحتی می توان آنها را شناخت. افرادی مبادی آداب بوده و هیچگاه افراد را با ارسال پیام های دوگانه سردرگم نمی کنند- آنها همان چیزی هستند که به نظر می آیند.";
		tv2.setText(temp);
		accord_container2.addView(tv2);
		//
		// element 3 - ISFJ
		LinearLayout accord_container3 = (LinearLayout) v
				.findViewById(R.id.accord_element3);
		temp = "شخصیت های ISFJ که اصطلاحاً آنها را حامی (Protectors) می نامیم، خوشبختانه ۱۰ درصد جمعیت جامعه را تشکیل داده اند زیرا علاقه اصلی و اولیه آنها امنیت و ایمنی کسانی است که برایشان مهم می باشند – اعم از خانواده، جمع دوستان، دانش آموزانشان، والدینشان، رئیسشان، همکارانشان و یا کارمندانشان.";
		temp += "\n" + "حامیان در کارهایشان حس فوق العاده بالایی از وفاداری و مسئولیت را دارا می باشند و به نظر می رسد آنگونه این کار را به انجام می رسانند که دیگران را از گزند خطرات و بلایای دنیا حفظ کنند. ریسک کردن و تجربه کردن آنها را نمی فریبد زیرا کسانی هستد که ترجیح می دهند اگر قرار است محصول و یا رویه ای را ارائه دهند، با حوصله و در زمان مناسب این کار انجام دهند. در محل کاری هم که قوانینش دائماً در حال تغییر است و یا به آداب و رسوم احترام گذاشته نمی شود، این تیپ از افراد زیاد خوشحال نخواهند بود. آنها به آداب و سنت ها احترام فراوانی قائلند هم در فرهنگ و هم در خانواده. ISFJ ها به ثبات رتبه های اجتماعی که به واسطه تولد، القاب، ادارات و اعتبارات به کسی نسبت داده می شود عمیقاً اعتقاد دارند. به تاریخ خانوادگی ارزش قائل شده و از اینکه مراقب دارایی های خانوادگی از خانه گرفته تا اثاثیه ها باشند لذت می برند.";
		temp += "\n" + "حامیان که عاشق خدمت به دیگران هستند، از کمک کردن به افراد نیازمند و ضعیف بیشترین رضایت را کسب می کنند و می توانند با معلولیت و نیاز دیگران بیشتر از هر تیپ دیگری کنار بیایند. آنها به اندازه پشتیبانان (ESFJ ها) پرصحبت و پرجنب و جوش نیستند و همین خجالتی بودنشان اغلب با خشک بودن و حتی سردمزاج بودن مورد قضاوت اشتباه قرار گرفته می شود، درحالیکه ISFJ ها خوش قلب و انسان دوست بوده و با خوشحالی به نیازمندان محبت می کنند.";
		temp += "\n" + "حس مراقبت آنها را باید به عنوان بیان محبت و جدیت هدفشان در نظر گرفت. آنها سخت کوش ترین افراد در میان دیگر تیپ ها هستند، دوست دارند ساعت های طولانی به تنهایی کارهایی که دیگران انجام نمیدهند را انجام دهند که اغلب مورد ناسپاسی قرار می گیرند. زمانیکه به تنهایی کار می کنند کاملا خوشحال هستند؛ در حقیقت در مقام مسئول حاضرند تمام کارها را خودشان انجام دهند به جای اینکه بعضی از کارها را به دیگران تفویض کنند. قناعت و صرفه جویی یکی از محاسن آنهاست. همچنین بیش از هر تیپ دیگری ارزش پول را می دانند و از ولخرجی و سوء استفاده از پول متنفرند. صرفه جویی و ذخیره کردن، کنارگذاشتن چیزی در برابر آینده غیرقابل پیش بینی و آماده شدن برای حوادث غیرمترقبه کارهایی هستند که ISFJ ها مطمئناً انجام خواهند داد. به خاطر همین موارد، حامیان اغلب بیش از حد انتظار کار می کنند و در اغلب اوقات نیز مورد سوء تفاهم قرار گرفته و کم ارزش قلمداد می شوند. مشارکت ها و همچنین کارهای اقتصادیشان اغلب به صورت بلاعوض درنظر گرفته شده و به ندرت به صورت شایسته از آنها تقدیر می شود.";
		tv3.setText(temp);
		accord_container3.addView(tv3);
		//
		// element 4 - ISTJ
		LinearLayout accord_container4 = (LinearLayout) v
				.findViewById(R.id.accord_element4);
		temp = "شخصیت ISTJ یا به اصطلاح دکتر کرسی بازرسان (Inspectors) افرادی هستند که به شدت می توان به آنها اعتماد کرد. چه در محیط منزل باشند چه در محیط کار، آنان افرادی هستند که وظیفه شناسی و پشتکار بسیار بالایی دارند. این موضوع وقتی اهمیت بیشتری پیدا می کند که آنان مسئول نظارت بر افراد یا محصولات تحت اختیارشان باشند. از نظر بازرسان، تمام قوانین باید رعایت شده، از ضوابط پیروی شده و استانداردها نیز به کار گرفته شوند.";
		temp += "\n" + "بازرسان که حدود ۱۰ درصد جمعیت جامعه را تشکیل می دهند، محافظان و نگهبانان حقیقی سازمان ها می باشند. آنان هنگام کار با رویه های موجود در یک سازمان صبر خاصی پیشه می کنند، هر چند باید گفت که با افرادی که قصد دارند به صورت غیرقانونی از قوانین تبعیت نکنند آنچنان هم صبور نیستند. بازرسان که در اصل افرادی مسئولیت پذیر هستند، زمانی خرسند خواهند شد که افراد حدود وظایفشان را دانسته، از خط مشی ها تبعیت کرده و در چارچوب قوانین عمل کنند. یکی از دغدغه های اصلی آنها این است که محصولات حتما مورد آزمایش قرار گرفته و برنامه زمانبندی نیز به نحو احسن اجرا شود، منابع نیز بر اساس استاندارد و بر اساس آنچه آنان در نظر دارند به درستی تحویل شود. و باید گفت که آنها انتظار دارند تمام افراد اطرافشان دارای چنین خصوصیتی باشند که بتوان بر روی آنها حساب باز کرد. زمانی که حرف از اجرا شدن دقیق قوانین در محل کار باشد، بازرسان افرادی به شدت سختگیر خواهند شد و حتی در گزارش دادن نقض قوانین به مراجع ذیصلاح هیچ درنگی نخواهند کرد. به همین دلیل است که اکثر افراد در مورد آنها این قضاوت اشتباه را می کنند که بازرسان افرادی سنگ دل و کاملا بیرحم هستند، زیرا نمی توانند قصد و نیت خیر آنها و نیز آسیب پذیریشان در مقابل انتقاد را ببینند. همچنین از آنجاییکه بازرسان کار نظارت خود را بدون هیچ گونه زرق و برق و هیاهویی انجام میدهند، بخش اعظمی از فداکاریشان در محل کار نادیده گرفته شده و بدون هیچ تقدیر و تشکری باقی می ماند.";
		temp += "\n" + "بازرسان همانند ESTJ ها (ناظران) پرحرف نیستند، با این حال افرادی به شدت اجتماعی بوده و در اکثر سازمان های خیریه و اجتماعی شرکت کرده و خود را وقف خدمت به دیگران می کنند. بازرسان نیز همانند همه سنتی ها، به مراسم خانوادگی نظیر ازدواج، جشن تولد و میهمانی ها توجه خاصی دارند – البته باید گفت که اگر این میهمانی ها خیلی بزرگ و یا عمومی شود آنها تمایل دارند که گوشه ای نشسته و زیاد در تجمعات شرکت نکنند. به طور کلی آنها با هر چیزی که خیلی زرق و برقدار و تجملی باشد احساس راحتی ندارند. تمایل دارند که حرفهایشان ساده و متواضعانه باشد به جای اینکه از کلمات پر طمطراق و خودنمایانه استفاده کنند؛ دوست دارند به جای لباس های مد روز از لباس های ساده و معمولی استفاده کنند؛ محیط خانه و کارشان نیز معمولا تمیز، مرتب و سنتی است بر خلاف آن دسته از افرادی که در محیط های پر زرق و برق زندگی می کنند. یکی از خصوصیت های شخصی بازرسان این است که معمولا آیتم ها و اقلام استاندارد را در مقابل محصولاتی که آخرین مدل بوده و پر از امکانات مختلف است ترجیح داده و اغلب به دنبال چیزهای کلاسیک و عتیقه هستند – به همین خاطر است که چیزهای قدیمی و از مد افتاده را به چیزهای جدید تازه به بازار آمده ترجیح می دهند.";
		tv4.setText(temp);
		accord_container4.addView(tv4);
		//
		// element 5 - ESTP
		LinearLayout accord_container5 = (LinearLayout) v
				.findViewById(R.id.accord_element5);
		temp = "شخصیت های ESTP یا استدلالگران (Promoter) فراوانی در جامعه وجود دارند – شاید ده درصد جامعه و یا بیشتر. در یک کلام، آنان زنان و مردان اهل عملند. وقتی از یک استدلالگر حرف می زنیم، مطمئن باشید که اتفاقی در حال رخ دادن است: چراغ ها روشن شده، موسیقی ها نواخته شده و بازی ها شروع خواهند شد. یک استدلالگر که انسانی زیرک و پر از شور و انرژیست، با یک جلوه در خور تماشا زندگی می کند تا حدی که اکثر اتفاقات روزمره و روتین زندگی را تبدیل به یک چیز هیجان انگیز خواهد کرد. آنها وقت خود را زیاد صرف رویدادهای تکراری نمی کنند. استدلالگران در کار و بازی، همیشه فعالیت ها و چالش های جدیدی را طلب می کنند. آنقدر شجاع، بی باک و خوشبین هستند که موانع را به راحتی از راه خود بر می دارند و برای رسیدن به اهداف خود دست به خطرهای بزرگی می زنند و از دید دیگران همیشه در حال راه رفتن بر لبه تیغ هستند. به همین دلیل، آنها مدیران و مذاکره کنندگانی هستند که مناسب موقعیت های پرخطر بوده و می توانند کارآفرینانی برجسته باشند. آنها می توانند چندین معامله و پیشنهاد را در دست داشته باشند و با یک حرکت جهشی سازمانی را به راه بیاندازند بگونه ای که دیگر تیپ ها قادر به انجامش نیستند.";
		temp += "\n" + "استدلالگران اشتهای سیری ناپذیری برای چیزهای بهتر در زندگی دارند، بهترین غذاها و نوشیدنی ها را می خورند، ماشین های گرانقیمت سوار می شوند و لباس های مد روز به تن می کنند. آنها در حلقه های اجتماعی افرادی به شدت پیچیده هستند، خیلی چیزها را می دانند، افراد را با نام کوچک به خاطر می سپارند و می دانند چه چیز را چه موقع بگویند تا بتوانند بیشترین منفعت را از افراد ببرند.";
		temp += "\n" + "استدلالگران افرادی جذاب، بی پروا و محبوب بوده و دوستان و سرمایه گذاران را با منبع بی پایانی از داستانها و لطیفه ها خوشحال می کنند. در عین حال، این افراد گاهی اوقات برای دیگران مرموز به نظر می رسند. در عین اینکه استدلالگران در لحظه زندگی می کنند و به صورت غیر منتظره به تمام روابطشان انرژی و هیجان می دهند، اما به ندرت پیش می آید که اجازه دهند کسی به آنها خیلی نزدیک شود. آنها معمولا صبر و بردباری کمی برای تعهد و مسئولیت پذیری دارند و درست وقتی که انتظار می رود پای تعهدشان بایستند ناگهان صحنه را ترک می کنند. استدلالگران قوانین را به خوبی می دانند: «کسی که می خواهد سریعتر از همه سفر کند، باید تنها باشد.»";
		temp += "\n" + "احتمال اینکه آنان برای مدتی طولانی تنها باشند بسیار کم است، تا حدی که شجاعت و حس ماجراجویی آنها برای دیگر افراد بسیار جذاب به نظر می رسد.";
		tv5.setText(temp);
		accord_container5.addView(tv5);
		//
		// element 6 - ESFP
		LinearLayout accord_container6 = (LinearLayout) v
				.findViewById(R.id.accord_element6);
		temp = "شخصیت های ESFP یا مجریان (Performers) در میان دیگر تجربه گرایان، توانایی خارق العاده ای در شاد کردن افراد اطراف خود دارند. آنها این کار را با گرمی خاص خود، حس طنزگونه ی ذاتی و اغلب مهارت های شگفت انگیز در موسیقی، کمدی و درام انجام می دهند. مجریان چه در محیط کار باشند چه در منزل، افرادی پر از هیجان و شادی هستند. علاقه اجتماعی فوق العاده آنها انگیزه دادن به افراد دور و بر خود است تا زمانی را برای استراحت به آنها بدهند تا از استرس های کار و نگرانی خلاصی یافته و از زندگی لذت ببرند.";
		temp += "\n" + "تعداد مجریان زیاد است، شاید حدود ۱۰ درصد جمعیت، و این نکته بسیار خوبی است زیرا آنان باعث می شوند که زندگی ما شادتر شود. آنها کسانی هستند که در موردشان به درستی می توان گفت که «تمام دنیا صحنه نمایش آنهاست». به صورت مادرزادی سرگرم کننده هستند، عاشق به هیجان آوردن بینندگان بوده و هر جایی که باشند به سرعت به کانون توجه بدل می شوند. اصلا دوست ندارند تنها باشند و هر وقت که بتوانند دنبال یار و همراه می گردند، که اغلب موفق به انجام این کار می شوند. مجریان افرادی زرنگ، پرحرف و بذله گو می باشند؛ به نظر می رسد همیشه آخرین جوک ها و داستان ها را می دانند. در کنایه زدن و بازی با کلمات چیره دستی مثال زدنی دارند و خدا نکند اگر بخواهند این کار را برای تفریح انجام دهند. آنان دوست دارند در هر چیزی از دیگران پیشی بگیرند، نمونه اش هم این است که همیشه لباس های مد روز، غذاها و نوشیدنی های جدید و آخرین موسیقی ها را امتحان می کنند. عصاره اصلی زندگی آنها سرزندگی و آزادی و رها بودن است؛ در میهمانی ها در مرکز توجه و انرژی بوده و تمام تلاششان را می کنند تا افراد اطراف خود را ترغیب به خوردن و نوشیدن و شادبودن کنند.";
		temp += "\n" + "استعداد خدادادی ESFP ها برای لذت بردن از زندگی، بخش زنده و اصلی آنها می باشد، ولی باید به این موضوع نیز توجه داشت که همین لذت جویی از زندگی باعث می شود که وسوسه های بیشتری نیز نسبت به سایر تیپ ها سراغ آنان بیاید. لذت به خودی خود می تواند برای آنها هدف باشد و تنوع طلبی نیز چاشنی زندگی. بنابراین ESFP ها سعی می کنند هر چیزی که اوقات خوبی را برای آنان رقم بزند مورد آزمایش و تجربه قرار دهند، که البته در اغلب موارد به سرانجام و عواقب کار خود فکر نمی کنند.";
		temp += "\n" + "شخصیت های ESFP همانند دیگر تجربه گرایان، به شدت مثبت اندیش می باشند. شعار اصلیشان این است: «همیشه به نیمه پر لیوان نگاه کن» – و تا آنجا که بتوانند با نادیده گرفتن نیمه خالی لیوان از نگرانی ها و دردسرها دوری می کنند. در میان تمام تیپ ها، ESFP ها سخاوتمندترین آنها می باشند ولی از نظر مهربانی بعد از ISFP ها قرار می گیرند. ESFP ها بسیار صادق می باشند – آنچه به آنان تعلق دارد به شما نیز تعلق دارد – بنابراین از نظر صرفه جویی و حفظ منابع و سرمایه کمی ضعیف عمل می کنند. آنان هر چه را که در اختیار داشته باشند بدون هیچ چشمداشت و توقعی به شما می دهند، فقط به خاطر اینکه رهابودن و بخشیدن را دوست دارند. ESFP ها اعتقاد دارند، زندگی آنقدر بخشنده است که منبعی لایزال و تمام نشدنی از جریان حیات و لذت است.";
		tv6.setText(temp);
		accord_container6.addView(tv6);
		//
		// element 7 - ISFP
		LinearLayout accord_container7 = (LinearLayout) v
				.findViewById(R.id.accord_element7);
		temp = "شخصیت های ISFP که از این پس آنان را هنرمند (Composer) می نامیم، بیش از دیگر تجربه گراها با حواس خود در تماس و هماهنگی هستند. بنابراین در تمام انواع آثار هنری از شامه بسیار تیزی در مورد اینکه چه چیزی به آنان تعلق دارد و یا تعلق ندارد برخوردار می باشند. درحالیکه دیگر تجربه گرایان مهارت و تخصص خاصی در کار با ابزارآلات و ارتباط برقرار کردن با مردم و سرگرم کردن آنها دارند، هنرمندان توانایی خارق العاده و بالفطره ای در کار با انواع رنگ ها، صداها، عطرها و طعم ها دارند.";
		temp += "\n" + "اگر چه هنرمندان ساعت های طولانی را در خلوت گذرانده و مشغول خلق آثار هنری هستند، اما همچون دیگر تجربه گرایان انگیزه های لحظه ای و تکانه ای خاصی را دارا می باشند. آنها برای حرکات و رفتارهایشان ملاحظات خاصی را در نظر نمی گیرند؛ به جای آن سعی می کنند در همین جا و همین لحظه زندگی کرده و برنامه ریزی خاصی برای آن نداشته باشند. هنرمندان در اکثر مواقع مشغول ساخت آثار هنری می باشند آنچنانکه بعضی اوقات همچون گردباد اسیر آن می شوند. هنرمندان اغلب در حال نقاشی کردن، مجسمه سازی، رقصیدن یا نوشتن قطعات موسیقی هستند. این کار را انجام می دهند چون صرفا باید آن کار را بکنند. از کوه بالا می روند چون کوه وجود دارد.";
		temp += "\n" + "توانایی غرق کردن خود در فعالیت ها گاهی اوقات کارهای عجیب و دیدنی برخی از هنرمندان را توجیه می کند با این حال آنان در جنبه های اجتماعی مهربانی بی همتایی در مقایسه با دیگر تیپ ها به نمایش می گذارند. هنرمندان نسبت به درد و رنج دیگران به شدت حساس بوده و به راحتی با شخص رنج کشیده احساس همدردی می کنند. برخی از آنان روش های همزادپنداری فوق العاده ای با جوانان دارند تا حدی که رابطه طبیعی قدرتمندی از همدردی و اعتماد میان آنها برقرار می شود.  رابطه مشابهی از این دست را می توان میان هنرمندان و حیوانات ، حتی حیوانات وحشی، مشاهده کرد. بسیاری از ISFP ها توانایی این را دارند که به مدت طولانی در طبیعت زندگی کنند و جالب توجه این که طبیعت نیز به آنان خوشامد می گوید.";
		temp += "\n" + "هنرمندان نیز همچون دیگر تجربه گرایان تعداد زیادی از مردم را شامل می شوند، شاید نه یا ده درصد از جمعیت جامعه، اما در کل به سختی می توان آنها را رصد کرد و اغلب از سوی دیگران به درستی شناخته نمی شوند. بخش اعظمی از این عدم شناخت به خود آنها باز می گردد. آنان گرایش زیادی به ابراز نکردن خود در جامعه دارند و ترجیح می دهند به جای آنکه از طریق زبان و گفتار شناسایی شوند از طریق آثار هنریشان شناخته شوند. معمولاً هنرمندان علاقه خاصی به توسعه توانمندیهای سخنوری در عموم ندارند؛ بیشتر ترجیح می دهند نبض زندگی را از طریق لمس آن در عضلات، چشم ها، گوش ها و زبانشان احساس کنند. بی هیچ شک، هنرمندان نیز همانند دیگر تیپ ها علاقمند به اشتراک گذاشتن دیدگاه خود از دنیا هستند، و اگر روشی متعادل از رابطه غیر کلامی به شیوه ای تقریبا هنری را پیدا کنند با زیبایی و بلاغت کامل می توانند شخصیت خود را توصیف کنند. اگر نتوانند این کار را بکنند، به راحتی ناشناس باقی مانده و سکوت آنها باعث می شود که شخصیتشان به طور کامل محو گردد.";
		tv7.setText(temp);
		accord_container7.addView(tv7);
		//
		// element 8 - ISTP
		LinearLayout accord_container8 = (LinearLayout) v
				.findViewById(R.id.accord_element8);
		temp = "طبیعت ISTP ها یا صنعتگران (Crafter) به وضوح در مهارت فوق العاده آنها در استفاده از انواع ابزارآلات ، تجهیزات، ماشین ها و دستگاه ها دیده می شود. البته اکثر ما در استفاده از ابزارآلات ظرفیت خاصی داریم، اما صنعتگران (حدود ده درصد جمعیت) واقعا در استفاده از ابزارآلات استاد هستند. آنها دارای توانایی ذاتی در فرمان دادن به ابزارآلات و استادشدن در تمام مهارت های مورد نیاز برای استفاده از آنها می باشند. حتی از زمان های نخستین، ابزارآلات همچون آهنربا به آنها چسبیده بودند – هر گاه که می خواستند به راحتی می توانستند از آنها استفاده کنند.";
		temp += "\n" + "همچون دیگر تجربه گرایان، صنعتگران افرادی هستند که عاشق عملند و به صورت ذاتی می دانند که فعالیت هایشان لذت بخش تر و مؤثرتر خواهد بود اگر به صورت انگیزشی، خودبخودی و بدون زمانبندی یا استاندارد خاص انجام شود. زمانیکه مجبور به کاری می شوند با ابزارهای خود کار نمی کنند بلکه تا حدی کار را جدی نگرفته و فقط با آنها بازی می کنند. همچنین صنعتگران بر اساس طبیعت انگیزشی که دارند دائم به دنبال بازی کردن هستند و در هر فرصتی که پیدا می کنند و میل و رغبتشان می کشد این کار را انجام می دهند. دوست دارند با سرگرمی های مختلفی بازی کنند: از ماشین و موتورسیکلت و قایق و تفنگ شکاری گرفته تا قلاب ماهیگیری و لباس غواصی و غیره. آنها وقتی که هیجان زیادی دارند پیشرفت خوبی می کنند برای مثال هنگام اتومبیل رانی سرعت، اسکی روی آب و موج سواری به اوج هیجانی خود می رسند. هنگام کارکردن از هیچ چیز نمی ترسند، بارها و بارها خودشان را در معرض خطر قرار می دهند حتی اگر چندین بار مجروح شوند. در میان تمام تیپ ها، صنعتگران کسانی هستند که بیشترین ریسک را انجام می دهند. خودشان و یا تکنیک هایشان را دائما در مقابل خطرات و اتفاقات شانسی و عجیب و غریب قرار می دهند.";
		temp += "\n" + "شناختن صنعتگران سخت است. شاید به این دلیل که آنها بیشتر ترجیح می دهند از طریق عمل کردن ارتباط برقرار کنند و علاقه کمی به توسعه مهارت های زبانی دارند. ضعف آنها در خودبیانگری می تواند باعث شود که در محیط مدرسه و یا کار دچار انزوا شوند. حتی وقتی هم که در کنار همنوعان خود قرار دارند سعی می کنند مهارت ها و عملشان به جای آنها صحبت کند و مکالمه زبانی آنها محدود به چند کلمه کوتاه و مختصر می شود.";
		temp += "\n" + "صنعتگران می توانند به طور عجیبی سخاوتمند و وفادار به دوستان، هم تیمی ها و همکارانشان باشند. اغلب حاضرند دست از تفریح و استراحتشان بکشند تا بتوانند به دوستانشان در پروژه های ساختمانی، تعمیر لوازم منزل یا کار بر روی اتومبیل یا قایق کمک کنند. از سوی دیگر، آنها می توانند با کسانی که دائم به دنبال قانونمندی و نظم بیش از حد هستند به طور شدیدی مخالفت کنند.";
		temp += "\n" + "صنعتگران معمولا به طور علنی به مخالفت با قوانین نمی پردازند، بلکه خیلی راحت آنها را نادیده می گیرند. بیش از هر چیزی، صنعتگران می خواهند برای انجام کارهای موردعلاقه شان کاملا آزاد باشند و حتی وقتی می توانند کارها را با مهارتی هنرمندانه انجام دهند به خود مغرور می گردند.";
		tv8.setText(temp);
		accord_container8.addView(tv8);
		//
		// element 9 - ENTJ
		LinearLayout accord_container9 = (LinearLayout) v
				.findViewById(R.id.accord_element9);
		temp = "شخصیت های ENTJ که ما آنان را ژنرال (Fieldmarshal) می نامیم دارای بالاترین میزان مدیریت میدانی و سازماندهی در شرایط مختلف هستند. دومین خصوصیت بارز ژنرال ها سازماندهی در شرایط حساس و غیرمترقبه است که خوشبختانه آنها در این مورد دارای قدرت بالفطره ای هستند. اگرچه مهندسی ساختاری و عملیاتی تا حدی در عملیات سازمانی مورد استفاده قرار می گیرد، اما ژنرال ها در این زمینه کمی نسبت به دیگر تیپ های بینشی عقب هستند و با مرور زمان می توانند این مهارت را در خود تقویت کنند. به هر باید گفت که هر نوع تمرین استراتژیک می تواند توانایی های افزونتری را به قابلیت های مهندسی و نیز مهارت های سازماندهی آنان بیافزاید.";
		temp += "\n" + "ژنرال ها که به سختی حدود ۲ درصد از جمعیت جامعه را تشکیل می دهند، افرادی هستند که برای رهبری به دنیا آمده اند و از همان دوران کودکی نیز می توان تشخیص داد که به گروه های کوچک دوستانشان دستور می دهند. در برخی موارد آنها خودشان را مسئول گروه ها می دانند و بعضی اوقات گیج می مانند که این اتفاق چگونه رخ داد. اما می توان دلیل این اتفاق را اینگونه توجیه کرد که آنها از همان دوران کودکی در هر جایی که باشند قدرت بالفطره و طبیعی در دستور دادن و فرماندهی دارند تا بتوانند افراد را در میادین مختلف اداره کرده و آنان را برای رسیدن به اهداف موردنظر هدایت کنند. آنها در تهیه نقشه برای یک کار، شرکت و یا سازمان همانند سرپرست ها یا ESTJ ها عمل می کنند اما ژنرال ها بیشتر به جای آنکه به دنبال قوانین و رویه ها باشند به دنبال سیاست ها و اهداف می باشند.";
		temp += "\n" + "آنها نمی توانند سازمان ها را ایجاد کرده و نمی توانند اهدافشان را پیاده سازی کنند. زمانیکه ژنرال ها مسئولیت یک سازمان را بر عهده دارند، خواه نظامی، تجاری و آموزشی باشد خواه دولتی، بیش از هر تیپ دیگری این قدرت را دارند که مسیر و افق نهایی که سازمان باید به آن برسد را به تصویر بکشند و به نظر می رسد که به راحتی می توانند آن تصویر را با دیگران به اشتراک بگذارند. مهارت های سازماندهی و همکاری آنها به خوبی توسعه یافته است، و این بدان معناست که در قاعده بخشیدن به موضوعات مختلف، رتبه بندی اولویت ها، کلیت بخشی، خلاصه سازی، مدیریت میدانی و به تصویرکشیدن ایده هایشان دارای قدرت های بالایی هستند. به نظر می رسد قدرت سازماندهی آنها از قدرت تحلیل کردنشان قویتر است و اگر رهبران ENTJ بخواهند قدرت تحلیلشان را افزایش دهند باید تبدیل به مخترع (ENTP) و یا مهندس (INTP) شوند.";
		temp += "\n" + "ژنرال ها در جامعه به مراتب رفیع مسئولیتی و مدیریتی می رسند و از این موضوع نیز خرسندی کامل دارند. آنها از اینکه تمام انرژیشان را صرف اهداف و کارشان کنند هیچگاه احساس خستگی نکرده و به راحتی می توانند دیگر بخش های زندگیشان را به خاطر مسائل کاری بلوکه کنند. ژنرال ها در هر حوزه ای اعم از پزشکی، حقوق، تجارت، آموزش، حکومت و نظامی گری، مدیرانی برجسته بوده و می توانند بخش های تحت مدیریت خود را با سیستم های ظریف و دقیق عملیاتی، برنامه ریزی صحیح در جهت پیشرفت و اهداف کوتاه مدت و بلندمدت اجرایی رهبری کنند. یک ژنرال برای انجام هر کاری همیشه باید یک دلیل هدفمند داشته باشد و احساسات افراد نیز معمولا دلیل کافی برای آنها نمی باشد. آنان ترجیح می دهند که تصمیماتشان بر اساس اطلاعات غیرشخصی باشد و می خواهند بر روی برنامه هایی کار کنند که به خوبی طرح ریزی شده باشند – مانند استفاده از عملیات مهندسی شده – و انتظار دارند که بقیه نیز از این روش تبعیت کنند. از خواسته های آنها می توان به کاهش خطوط قرمز کاغذبازی، دوباره کاریها و سردرگمی بی هدف در محیط کار اشاره کرد و کارمندانی را که نمی توانند خودشان را با برنامه های آنها وفق دهند و کاراییشان را افزایش دهند به راحتی اخراج می کنند. با این وجود ENTJ ها با رویه های ثابت شده و بدون تغییر مشکل دارند و هر دستورالعملی را که قصد ناکارآمدسازی آنها در دستیابی به اهدافشان باشد به راحتی نقض کرده و کنار می گذارند. یکی از خصوصیات ژنرال ها این است که به راحتی می توانند ناکارآمدی ها و مشکلات را ریشه یابی کرده و از بین ببرند و نیز در مقابل تکرار خطاها هیچ صبر و حوصله ای از خود نشان نمی دهند.";
		tv9.setText(temp);
		accord_container9.addView(tv9);
		//
		// element 10 - ENTP
		LinearLayout accord_container10 = (LinearLayout) v
				.findViewById(R.id.accord_element10);
		temp = "ما از این پس ENTP ها را مخترع (Inventor) می نامیم. مخترعان ساخت ماشین ها و ابزارآلات را از همان دوران کودکی شروع می کنند و هیچگاه دست از این کار بر نخواهند داشت اگرچه زمانیکه وارد بزرگسالی می شوند ابداعات و اختراعات خود را تبدیل به انواع سازمان ها، مجامع و نیز دستگاه های مکانیکی می کنند. در جامعه مخترعان زیادی وجود ندارد شاید بتوان گفت حدود دو درصد از جمعیت جامعه، اما تأثیر بسزایی را بر زندگی روزمره تک تک اعضای جامعه دارند. مخترعان با ابداعات و روحیه کارآفرینشان همیشه به دنبال راه حل های بهتر هستند، پیوسته چشم به اجرای پروژه ها، سازمانها و فرایندهای جدید بسته اند. مخترعان به شدت عملگرا بوده و در راه اختراع مؤثرترین ابزارها در رسیدن به اهدافشان تبدیل به افرادی خبره می شوند. در میان تمام تیپ ها، اگر قرار باشد کاری انجام شود تنها به این دلیل که همیشه به همان روش همیشگی انجام می شده است، مخترعان بی میل ترین افراد در انجام آن کار خواهند بود. در نتیجه مخترعان همیشه راه حل های تازه و جالبی را در کار و بازی های خود ابداع می کنند. ENTP ها افرادی به شدت کنجکاو بوده و زمانیکه مشغول حل مسائل پیچیده هستند پیوسته به دنبال احتمالات و پیشامدها می گردند. ذهن مخترعان پر از ایده های گوناگون است، اما تنها به ایده هایی ارزش می گذارند که از فعالیت ها و اهداف مرتبط به آن اطلاع حاصل کنند. بنابراین هنگام طراحی یک محصول، به فرایند طراحی به عنوان هدف نمی نگرند، بلکه آنرا وسیله ای برای رسیدن به هدف در نظر خواهند گرفت، روشی برای اختراع یک نمونه اولیه که اولا کار کند و ثانیا قابلیت ارائه به بازار را داشته باشد. مخترعان به عملگرایی خود اطمینان کامل دارند، به جای آنکه نقشه های ریز و جزئی از پیشرفت کار را تهیه کنند به توانایی های خود در یافتن روش ها و ابزارهای کارآمد حساب خواهند کرد. یک ایده چالش برانگیز تمام  آن چیزی است که آنها نیاز دارند تا آمادگی خود را برای وارد شدن به حیطه عمل اثبات کنند.";
		temp += "\n" + "مخترعان معمولا حلقه دوستان سرزنده و شادابی دارند که به ایده ها و فعالیت های خود علاقمندند. افرادی راحت و انعطاف پذیر بوده و به ندرت پیش می آید که در مورد مسأله ناراحت شده و یا زبان به گلایه باز کنند. ENTP ها معمولا افرادی پر حرف و خوش صحبت بوده و می توانند ایده های پیچیده خود را به راحتی بیان کنند و دیگران را با افکار خود همراه سازند. با این حال زمانیکه شروع به جر و بحث می کنند به راحتی از تکنیک ها و مهارت های سخنوری استفاده کرده و از همین نکات بر علیه رقبای خود استفاده می کنند.";
		temp += "\n" + "مخترعان معمولا در محیط کار خود همرنگ دیگران نمی شوند و تا زمانیکه شرایط کاریشان بیش از حد ملالت آور نشده باشد می توانند در محل کارشان دوام بیاورند. در پروژه های پایلوت آنها مدیران و رهبران برجسته ای هستند که می توانند نبوغ و استعداد خود را مورد آزمون قرار دهند. در مهندسی روابط انسانی و سیستم های انسانی افرادی خبره بوده و به سرعت سیاست ها و خط مشی های موجود در سازمان را جمع آوری کرده و همیشه به جای آنکه به افراد داخل سازمان بگویند که چه کاری انجام دهند خواهان درک و تحلیل آنها می باشند. فارغ از شغل و کاری که دارند، مخترعان استعداد خارق العاده ای را در رسیدن به مدارج بالای مسئولیتی از خود نشان می دهند. جمله «نمی توان انجامش داد» یکی از بزرگترین چالش های موجود در برابر یک مخترع است و او نیز در عوض پاسخ «من انجامش می دهم» را سرلوحه کارهای خود قرار می دهد.";
		tv10.setText(temp);
		accord_container10.addView(tv10);
		//
		// element 11 - INTJ
		LinearLayout accord_container11 = (LinearLayout) v
				.findViewById(R.id.accord_element11);
		temp = "شخصیت INTJ که کرسی آنها را استراتژیست (Mastermind) نامیده است، یک سر و گردن از بقیه در برنامه ریزی در شرایط احتمالی بالاتر هستند. عملیات پیچیده که مستلزم مراحل متعدد، یکی پس از دیگری و پی در پی هستند به راحتی توسط استراتژیست ها مورد واکاوی و تجزیه و تحلیل قرار می گیرند و حتی آنها خود را برای شرایط و موقعیت های پیچیده تر و سخت تر آماده می کنند به گونه ای که همیشه راه حل دیگری برای آن مسائل در نظر می گیرند. INTJ ها هر احتمالی را در نظر می گیرند و در زمان کار بر روی یک پروژه هیچ گاه صرفا به برنامه A در ذهن خود اکتفا نمی کنند، بلکه اگر نیاز باشد همیشه برنامه B یا C و یا حتی D را نیز در نظر خواهند داشت.";
		temp += "\n" + "فراوانی جمعیتی استراتژیست ها در جامعه بسیار پایین است، شاید یک یا دو درصد از جمعیت جامعه را تشکیل دهند. به ندرت بیرون از اداره، کارخانه، دانشگاه یا آزمایشگاه خود دیده می شوند. با این وجود رهبرانی به شدت لایق و کارآمد هستند؛ به هیچ وجه اشتیاقی به فرمان دادن ندارند و ترجیح می دهند همیشه در پشت صحنه کار خود را انجام دهند مگر اینکه دیگران قادر به انجام وظایف خود نباشند، اینجاست که آنها وارد میدان عمل خواهند شد. زمانیکه مسئولیتی را بر عهده می گیرند به طور تمام و کمال عملگرایی خود را به اثبات می رسانند. استراتژیست ها معتقدند که کارآمدی برای هر سازمان ساختاریافته ای ضروری است و اگر با ناکارآمدی روبرو شوند – هرگونه اتلاف منابع انسانی و مادی – به سرعت عملیات بازبینی و انتساب مجدد پرسنل را انجام می دهند. رویه ها و روال های ثابت هیچگاه دست و پای استراتژیست ها را نمی بندد، مراجع ذیصلاح سنتی و تبلیغات نیز هیچگاه نمی توانند بر آنها اثر بگذارند. آنان تنها ایده های قابل لمس را می پذیرند و آنهایی را که غیر ملموسند به راحتی کنار می گذارند، کاری هم ندارند که بقیه در موردشان چه فکری می کنند. این موضوع یادتان باشد: هدف آنها بهره وری و کارایی حداکثری است.";
		temp += "\n" + "استراتژیست در موقعیت های کاری معمولا به مدارج بالای مسئولیتی دست پیدا می کنند. طولانی مدت کار کرده و خود را وقف رسیدن به اهدافشان می کنند؛ هرگز وقت و انرژی خود و همکاران یا کارمندانشان را نیز هدر نمی دهند. یکی از مسائلی که استراتژیست را به راحتی تحریک می کند حل مسأله است. آنها عاشق پاسخدهی به سیستم های پیچیده ای هستند که نیازمند توجه و تمرکز دقیق و فراوانی است. آنها معمولا اتفاقات و شرایط مثبت را بازگو کرده و از نظردهی به اتفاقات منفی پرهیز می کنند. بیشتر علاقمند این هستند که سازمان را رو به جلو هدایت کنند تا اینکه در اشتباهات گذشته درجا بزنند.";
		temp += "\n" + "استراتژیست ها نسبت به دیگر تیپ های بینشی متکی به خود و مصمم هستند و معمولا دارای اراده ای قوی می باشند. به راحتی تصمیم می گیرند؛ در حقیقت تا وقتی که همه چیز مشخص نشده و در مورد آنها تصمیمی گرفته نشده است به خودشان اجازه استراحت نخواهند داد. اما پیش از اینکه تصمیمی بگیرند باید به طور کامل در مورد آن موضوع تحقیق و جستجو کرده باشند. استراتژیست ها به شدت اهل نظریه پردازی هستند، اما پیش از اینکه بخواهند ایده ای را مطرح کنند باید تمام داده ها و اطلاعات مرتبط با آن ایده را بررسی کرده باشند. نسبت به هر ایده و یا گفته ای که بر اساس تحقیقات مبهم و ناقص و یا بر خلاف واقعیت مطرح شده باشد، مشکوک بوده و هرگز آن را نمی پذیرند.";
		tv11.setText(temp);
		accord_container11.addView(tv11);
		//
		// element 12 - INTP
		LinearLayout accord_container12 = (LinearLayout) v
				.findViewById(R.id.accord_element12);
		temp = "ما از این پس INTP ها را مهندس (Architect) می نامیم. از این به بعد دیگر لازم نیست که مهندسین را صرفا افرادی بدانیم که در حال طراحی نقشه های معماری برای ساختمان ها، جاده ها و یا پل ها هستند. آنها طراحان چیره دست تمام انواع سیستم های نظری می باشند از قبیل طراحی ساختار آموزشی مدارس، استراتژی های سازمانی و فناوری های نوین. از نظر مهندسین، دنیا را باید تحلیل، درک، توصیف و از نو طراحی کرد. از نظر آنها واقعیت های بیرونی به خودی خود اهمیتی ندارند و بیشتر شبیه اطلاعات خامی هستند که باید تبدیل به مدل های ساختاریافته شوند. آنچه که برای مهندسین اهمیت دارد این است که آنها اصول بنیادین و قوانین طبیعی را به خوبی درک کرده و در طراحی هایشان که زیبا، کارآمد و یکپارچه است به کار ببرند.";
		temp += "\n" + "مهندسین و معماران بسیار اندک هستند شاید بتوان گفت یک درصد از جمعیت جامعه و دقت بسیار بالایی را در افکار و سخنانشان به کار می برند. آنها عادت دارند که تفاوت ها و ناهنجاری ها را بلافاصله رصد کرده و تناقض ها را فارغ از آنکه کی و کجا بوجود آمده اند شناسایی کنند. برای یک مهندس سخت است که حتی در یک مکالمه عادی حرف های بی ربط و نامحسوس بشنود و مطمئن باشید که حتما آن نکات مبهم را به گوینده تذکر می دهد. مهندسین در مذاکرات و مکالمه های جدی ویران کننده هستند زیرا مهارت آنها در چارچوب بندی مکالمات قدرت فوق العاده ای به آنها می دهد. INTP ها به تمام گفتگوها به چشم جستجویی برای دانستن می نگرند و معتقدند که عمل آنها قدمی در جهت رفع ناسازگاری هاست. همین امر شاید باعث شود که دیگران از گفتار آنها احساس راحتی نداشته باشند.";
		temp += "\n" + "آنان در مورد عملی کردن ایده هایشان هیچ اغماضی نمی کنند، به شدت کنجکاو بوده و همیشه به دنبال بهترین وسیله ها برای رسیدن به اهدافشان بوده و از هر اسلوب و قاعده ای که به دست بیاورند اقدام به یادگیری می کنند. آنها به صحبت های تازه کاران به خوبی گوش می کنند اگر ایده هایشان جالب و مفید باشد، و اگر گفته ای را بلااستفاده تشخیص دهند حتی اگر یک متخصص آن حرف را زده باشد هیچ اهمیتی به حرفش نمی دهند. صلاحیت و اعتباری که به واسطه سازمان، اعتبارات و یا معروف بودن به دست آمده باشد بر روی آنها تأثیرگذار نخواهد بود. مهندسین تنها به چیزهایی علاقمند می شوند که برایشان ملموس و محسوس باشد و هر حرفی که دارای یکپارچگی و ثبات باشد برای آنها دارای اهمیت خواهد بود.";
		temp += "\n" + "در اغلب اوقات شناخت INTP ها مشکل است. معمولا گفته ها حاکی از آن است که آنها به غیر از دوستان نزدیکشان با بقیه خجالتی هستند و به سختی می توان به عمق شخصیتی آنها پی برد. مهندسین بیش از هر تیپ دیگری قادر به تمرکز هستند و اغلب ترجیح می دهند که در محل کار خود تنها باشند و ساعت های متمادی سرشان به کار مشغول باشد. تجزیه و تحلیل معمولا آنها را آزار می دهد و همین امر نیز باعث ناراحتی و طرد دیگران می شود. وقتی درگیر یک مسأله می شوند، کاملا در لاک خود فرو می روند و تا وقتی که مسأله را به طور کامل حل نکنند و تمام ابعاد پیچیدگی آنرا واکاوی نکنند دست بردار نخواهند بود. آنها به هوش و فراست ارزش بالایی قائلند و و عطش سیری ناپذیری که برای کشف ساختار عالم دارند به نظر دیگران مغرور به نظر رسیده و حتی گاهی اوقات با کسانی که توانایی ها و انگیزه های پایین تری دارند رفتار نامناسبی خواهند داشت.";
		tv12.setText(temp);
		accord_container12.addView(tv12);
		//
		// element 13 - ENFP
		LinearLayout accord_container13 = (LinearLayout) v
				.findViewById(R.id.accord_element13);
		temp = "شخصیت های ENFP یا قهرمانان (Champions) همانند دیگر ایده آلیست ها کمیاب هستند، شاید حدود ۳ الی ۴ درصد جمعیت جامعه، اما باید گفت که آنها بیش از دیگر افراد به تجربیات عاطفی اهمیت داده و از آن به عنوان عنصری حیاتی برای یک زندگی کامل یاد می کنند. قهرمانان از گستره وسیعی از احساسات و عواطف بهره مند هستند و اشتیاق فراوانی برای تجربیات و چیزهای جدید دارند. دیدگاه آنها به زندگی یک درام هیجان انگیز و پر از موقعیت های خیر و شر است. آنان همیشه می خواهند تمام اتفاقات معنادار را تجربه کرده و با افراد الهام بخش در دنیا ارتباط برقرار کنند. در میان دیگر ایده آلیست ها برونگراترین آنها هستند و اشتیاق وصف ناپذیری برای گفتن تجربیات فوق العاده خویش به دیگران دارند.";
		temp += "\n" + "قهرمانان از صحبت کردن با دیگران خسته نمی شوند و همچون یک آبفشان که همواره در حال فوران آب است، آنها نیز جملات و کلمات مختلف را از ذهنشان بر روی زبانشان جاری می کنند. البته باید گفت که این کار یک داستان گویی ساده نیست؛ قهرمانان حرف می زنند (یا می نویسند) به این امید که بتوانند حقایقی را در مورد تجربیات انسانی فاش کنند و یا با عقاید محکم و راسخ خود در دیگران ایجاد انگیزه کنند. تمایل شدید آنها به صحبت کردن در مورد موضوعات و اتفاقات مختلف در کنار شوق و اشتیاق بی حد و حصر و نیز استعداد ذاتی کلامی، آنها را تبدیل به مسرورترین و الهام بخش ترین افراد در میان تمام تیپ ها کرده است.";
		temp += "\n" + "قهرمانان به شدت متکی به خود بوده و اشتیاق شدیدی به حوزه عملکردی و اعتباری شخصی خود دارند و همین نیت و خواست درونی که همیشه به دنبالش هستند عامل جذابیت آنان در میان دیگران می باشد. در عین حال، قهرمانان قدرت بینشی و شهودی فوق العاده ای دارند و می توانند بگویند که در درون افراد چه می گذرد و قادرند احساسات مخفی دیگران را خوانده و اهمیت خاصی برای گفتار و کردار افراد قائلند. در حقیقت، قهرمانان پیوسته در حال بررسی و پویش محیط اجتماعی اطراف خود هستند و هیچ شخصیت مرموز یا انگیزه خاموشی قادر به فرار از توجه آنها نیست. آنها در میان دیگر ایده آلیست ها شامه تیزتری داشته و افراد اطراف خود را با نظارت دقیقتری بررسی می کنند و حتی می توانند تمرکز شدیدی بر روی یک شخص خاص داشته باشند. توجه آنها به ندرت منفعلانه و سرسری است. از سوی دیگر، تمایل خاصی به حساسیت و هوشیاربودن بیش از حد دارند، همیشه آماده مواقع اضطراری بوده و حواسشان پیوسته به اتفاقات احتمالی اطرافشان جمع است.";
		temp += "\n" + "قهرمانان رابطه خوبی با مردم دارند و معمولا گستره وسیعی از ارتباطات فردی را شکل می دهند. با دوستانشان خونگرم و پر از انرژی هستند. دوست دارند با همکارانشان رابطه ای صمیمی و راحت داشته باشند و می توانند کارمندان و دانشجویانشان را با مهارت بالایی مدیریت کنند. در جامعه چهره ای محبوب داشته و در پشت تلفن بسیار خوش صحبتند و حتی گاهی اوقات آنقدر دراماتیک و خوش قلب می شوند که دیگران آرزو می کنند پیش آنها کار کنند. قهرمانان افرادی مثبت اندیش و پرخیر و برکت هستند و اغلب اطمینان و اعتقاد آنها به خیر و برکت در زندگی و طبیعت انسان باعث رخ دادن اتفاقات خوب می شود.";
		tv13.setText(temp);
		accord_container13.addView(tv13);
		//
		// element 14 - ENFJ
		LinearLayout accord_container14 = (LinearLayout) v
				.findViewById(R.id.accord_element14);
		temp = "شخصیت های ENFJ که شاخص ترین نماد آنها معلمان (Teachers) می باشند، تعدادشان از دیگر ایده آلگرایان بیشتر است و استعداد ذاتی در هدایت دانش آموزان یا کارآموزان دارند. اگر شغلشان معلمی نباشد پیوسته به فکر این کار هستند و قادرند توانایی بالقوه یادگیرندگان را به راحتی به آنها یادآوری کنند. معلمان (که حدود ۲ درصد جمعیت جامعه را تشکیل می دهند) قادرند بدون هیچ تلاشی و تقریباً پیوسته در رؤیای فعالیت های آموزشی فریبنده و جذاب برای دانش آموزانشان به سر ببرند تا بتوانند آنها را هر چه بیشتر علاقمند سازند. در برخی معلمان، این قوه تخیل تا حدی زیاد است که آنها را در زمره نوابغ قرار می دهد طوریکه دیگر تیپ ها قادر به تصور آن نیستند. اما شاید بتوان گفت که بزرگترین قدرت آنها در اعتقاد راسخشان به دانش آموزانشان نهفته است. معلمان همواره به دنبال بهترین چیزها در دانش آموزانشان هستند و به راحتی می توانند با آنها ارتباط برقرار کرده و قدرت های ناشناخته و بالقوه دانش آموزانشان را به آنان بازگو کنند و این حس اعتماد تا حدی است که می تواند الهام بخش دانش آموزانشان شود تا رشد کرده و به مراتبی از پیشرفت برسند که هیچ کس فکرش را هم نمی کند.";
		temp += "\n" + "معلمان در هر رشته ای که فعالیت داشته باشند، به افراد بالاترین اولویت را قائل شده و به صورت ذاتی با مسائل شخصی افراد ارتباط برقرار کرده و حس میل و رغبت آنها را تحریک می کنند. معلمان افرادی خونگرم و خوش صحبت هستند، شاید بتوان گفت در میان تمام تیپ ها خوش بیان ترین آنها هستند، در فنون زبانی و شفاهی قدرتمند بوده و این قدرت را در ارتباطات کلامی هنگام سخنرانی و گفتگوی چهره به چهره به اوج خود می رسانند. هرگز در رسا و گویا صحبت کردن درنگ نمی کنند و اجازه می دهند احساساتشان شناخته شود. معلمان با شوق و اشتیاق وصف ناپذیر صحبت می کنند و صدایشان با یک زرق و برق جذاب و شورانگیز شنیده می شود و حتی با تمرین نیز می توانند به یک سخنگوی کاریزماتیک در جامعه تبدیل شوند. چنین توانایی های کلامی این فرصت را به معلمان می دهد تا نفوذ و تأثیر بسزایی در گروه ها داشته باشند و همیشه از آنها خواسته می شود تا نقش رهبری را بر عهده بگیرند.";
		temp += "\n" + "معلمان کارهایی را دوست دارند که مشخص و سازماندهی شده باشند و ساعت ها برای کارهایشان زمانبندی خواهند کرد و البته فعالیت های اجتماعی در صدر کار آنهاست – آنان به حضور در چنین مجامعی به خود افتخار می کنند. معلمان به انجام دادن همکاری های بین فردی و روابط هماهنگ ارزش بالایی گذاشته و نسبت به خطاهای دیگران قدرت چشم پوشی زیادی دارند و به راحتی از کنار آن می گذرند و به خاطر همین اخلاقشان هر جا که می روند محبوب دیگران هستند.";
		temp += "\n" + "معلمان نسبت به دیگران به شدت حساس هستند و گفته می شود که حس شهود آنها به خوبی رشد کرده است.  به یقین می توان گفت که دیدگاه آنها نسبت به خود و دیگران بی نظیر است. بدون شک آنها می دانند که در درون افراد چه می گذرد و با قدرت و دقت باورنکردنی می توانند ضمیر افراد را بخوانند. نکته مثبت این است که به راحتی می توان آنها را شناخت و حقیقتا می توانند خصوصیات، عواطف و اعتقادات افرادی که در اطرافشان هستند را بدست بیاورند. به دلیل اینکه معلمان به صورت ناخودآگاه می توانند ضمیر افراد را تشخیص دهند، احساس نزدیکی زیادی را با اطرافیان خود دارند و به همین دلیل است که می توانند حس صمیمیت بالایی را با سختی ها و خوشی های کارمندانشان، همکارانشان، دانش آموزانشان، مشتریانشان و آنهایی که دوستشان دارند را برقرار کنند.";
		tv14.setText(temp);
		accord_container14.addView(tv14);
		//
		// element 15 - INFJ
		LinearLayout accord_container15 = (LinearLayout) v
				.findViewById(R.id.accord_element15);
		temp = "کرسی و دیگران INFJ ها را مشاور (Counselor) نامیده اند. آنها میل و رغبت فوق العاده ای در فراهم آوردن رفاه دیگران دارند و قادرند تعاملات شخصی قدرتمندی را با مردم برقرار کرده، رشد شخصی و درونی آنها را فراهم آورند و آنها را بگونه ای هدایت کنند تا قدرت های بالقوه انسانی خود را درک کنند. اگرچه آنان هنگام کارکردن (نظیر نویسندگی) که نیاز به خلوت و توجه بالا دارد خوشحال هستند، اما مشاوران هنگام کارکردن با افراد و گروه ها به خوبی عمل کرده و رابطه ای را برقرار می کنند که به هیچ وجه سطحی و ظاهری نیست و هر جایی که بتوانند یک زمان ساکت و خصوصی پیدا می کنند تا بتوانند باتری های خود را شارژ کنند! مشاوران در مدیریت دیگران هم مهربان هستند و هم مثبت؛ شنوندگان چیره دستی بوده و به نظر می رسد که به صورت بالفطره و طبیعی علاقمند کمک به دیگران هستند تا بتوانند مشکلات شخصیشان را حل کنند. مشاوران که اغلب رهبران مشهود و نمایانی نیستند ترجیح می دهند با نزدیکان خود کار کنند و تأثیراتشان را در پشت صحنه اعمال کنند.";
		temp += "\n" + "مشاوران کمیاب می باشند، شاید بتوان گفت حدود ۳ درصد جمعیت جامعه، و تا زمانیکه تمایل نداشته باشند درونی ترین افکارشان و یا عکس العملهای عاطفی قدرتمندشان را با دیگران به اشتراک بگذارند، البته به غیر از کسانی که دوستشان دارند، شناختن آنها بسیار مشکل خواهد بود. آنها افرادی هستند به شدت خصوصی، با یک زندگی درونی پیچیده و به طور غیرمعمولی غنی. دوستان و همکارانی که آنها را برای مدتهای طولانی میشناسند شاید از ظاهرشدن آنها در کنارشان و یا در جمع دوستان متعجب شوند. این بدان معنا نیست که مشاوران افرادی دمدمی مزاج و پراکنده هستند بلکه به یکپارچگی ارزش بالایی قائل می شوند اما به هر حال کسانی هستند که شخصیت های مرموز و به هم تنیده ای دارند که حتی گاهی اوقات خودشان را نیز گیج می کند.";
		temp += "\n" + "مشاوران تمایل دارند تا به صورت مؤثری در سازمان ها فعالیت کنند. به هماهنگی کارکنان ارزش گذاشته و هر کاری می کنند تا به کارکرد صحیح و بی عیب و نقص سازمان کمک کنند. آنان نظام های انسانی را می شناسند و به صورت خلاقانه ای از آن استفاده می کنند. در مشاوره دادن و همکاری با دیگران به خوبی عمل می کنند. مشاوران چه در نقش کارفرما باشند چه در نقش کارمند، به احساسات دیگران اهمیت داده و می توانند به خوبی میزان احساسات افراد را در سازمان ها اندازه گیری کنند.";
		temp += "\n" + "به INFJ ها قدرت تخیل زنده و روشنی هدیه شده است و اغلب آنها را جزو شاعرانه ترین افراد در میان تمام تیپ ها می دانند و در واقع در بخش اعظمی از کفتگوهای روزانه شان از تخیلات شاعرانه استفاده می کنند. استعداد شگرف آنها در قدرت های زبانی – هم به صورت نوشتاری هم گفتاری – معمولا نوعی قدرت ارتباطی به آنها بخشیده است که می توانند با افراد به شیوه های شخصی ارتباط برقرار کنند. مشاورین به شدت شهودی هستند و می توانند احساسات یا قصد و نیت افراد را – چه خوب چه بد – تشخیص بدهند حتی پیش از اینکه خود شخص متوجه شود. چنین حساسیت فوق العاده نسبت به دیگران می توانند بر پایه توانایی قابل توجه مشاورین در تجربه تمام پدیده های روانی بسیار به نفع آنان باشد.";
		tv15.setText(temp);
		accord_container15.addView(tv15);
		//
		// element 16 - INFP
		LinearLayout accord_container16 = (LinearLayout) v
				.findViewById(R.id.accord_element16);
		temp = "شخصیت های INFP که اصطلاحا آنها را شفادهنده (Healer) می نامیم چهره ای آرام و متین داشته و حتی از دید دیگران شاید کمی خجالتی به نظر برسند. اما در درونشان آنها همه چیز هستند جز خجالتی و می توانند دارای خصوصیت جالبی برای محافظت از خود باشند که به ندرت در میان دیگر تیپ ها دیده می شود. شفادهندگان می توانند به طور عمیقی به زندگی درونی عده معدودی از افراد خاص در زندگیشان اهمیت و توجه ویژه مبذول کرده و حتی می توانند این توجه را به خاطر دلیل مطلوبی به دنیا با یک دید کلی معطوف کنند. شوق و اشتیاق اصلی آنها برطرف کردن منازعات و تناقضاتی است که منجر به دردسر افتادن افراد و یا از هم پاشیده شدن گروه ها می شود، بنابراین آنها می توانند سلامتی و کمال را به خودشان، افراد نزدیک و جامعه شان به ارمغان بیاورند.";
		temp += "\n" + "شفادهندگان حس ایده آلگرایی بسیار بالایی دارند که این خصوصیت از حس قدرتمند شخصی شان در تشخیص راست و غلط ناشی می شود. آنها دنیا را به عنوان مکانی اخلاقی، محترم، پر از قابلیت های خارق العاده و اتفاقات خوب بالقوه ادراک می کنند. در حقیقت، برای فهمیدن و درک شفادهندگان، باید بدانیم که تعهد عمیق آنها به مثبت اندیشی خیر و برکت تقریبا بدون مرز و فارغ از خود است، و همین امر نیز الهام بخش آنهاست تا از خودگذشتگی های شگفت انگیزی را برای شخص یا چیزی که به آن اعتقاد دارند انجام دهند.";
		temp += "\n" + "آنان که به خاطر حریم شخصی خود و کمیاب بودنشان کمی از جوامع به دور هستند، حتی به خاطر خلوص و پاک بودن ایده آلگریشان ممکن است بیش از پیش در خلوت خود فرو روند.";
		temp += "\n" + "شفادهندگان به خاطر عدم درک شدن صحیحشان در دوران کودکی، به خوبی می توانند حس جدا افتادگی و طردشدگی را بفهمند. شفادهندگان در دوران کودکی معمولا در یک دنیای پر از فانتزی زندگی می کنند و در داستان هایشان اغلب نقش یک شاهزاده پریان را به خود گرفته و متأسفانه به خاطر همین مسأله از سوی والدین خود طرد شده و حتی تنبیه می شوند. زمانیکه والدینشان به آنها می گویند که دیگر زمان آن رسیده تا به خیالبافی و رؤیاپردازی پایان دهند، این حس به آنها دست می دهد که رؤیایی بودن کار بسیار ناشایستی است و به مرور این حس به آنها دست می دهد که چیزی جز یک جوجه اردک زشت نیستند. در حقیقت، تمام کارهای آنها بدون ایراد است، زیرا آن همانی هستند که باید باشند، اما باید گفت با دیگر جوجه اردک های دیگر کمی فرق می کنند.";
		temp += "\n" + "شفادهندگان در محیط کار افرادی انطباق پذیر هستند، از ایده ها و اطلاعات جدید استقبال کرده و در موقعیت های پیچیده و دشوار صبور هستند اما از جزئیات روتین متنفرند و صبر خود را از دست می دهند. شفادهندگان شامه بسیار تیزی در درک افراد و احساساتشان دارند و با دیگران به خوبی ارتباط برقرار می کنند. به خاطر حس تودار بودن قدرتمندی که دارند به راحتی و در کمال خوشحالی می توانند تنهایی کار کنند. وقتی تصمیمی میگیرند، از قلبشان تبعیت می کنند نه از مغزشان، و این بدان معناست که ممکن است در شناخت حقایق دچار اشتباه شوند و اما در درک احساسات به ندرت دچار اشتباه می شوند. علاقه طبیعی خاصی به فعالیت های پژوهشگری و تصویرگری دارند و همانند دیگر ایده آلگرایان توانایی خاصی در استفاده از خصوصیات کلامی خود دارند. در تفسیر و تعریف داستان ها و نیز خلق آنها توانایی بالایی داشته و بنابراین به راحتی می توانند شعر و ترانه بسرایند. آنان همواره یک ندای درونی می شنوند که می گوید جلو برو و به دنیا و دیگران کمک کن، ندایی که به نظر می رسد آنان همواره آماده پاسخگویی به آن می باشند حتی اگر لازم باشد راحتی و آسایش خود را فدای این کار بکنند.";
		tv16.setText(temp);
		accord_container16.addView(tv16);
		//

		// add another tab
		TabHost tabHost = (TabHost) dialog.findViewById(R.id.TabHost01);
		tabHost.setup();
		TabHost.TabSpec spec2 = tabHost.newTabSpec("TabTwo");
		spec2.setIndicator("انواع شخصیت ها", Model2LevelsActivity.this
				.getResources().getDrawable(R.drawable.ic_launcher));
		spec2.setContent(R.id.accordion_scroll);
		tabHost.addTab(spec2);
		//

		Button dialogButton = (Button) dialog.findViewById(R.id.buttonOk);
		// if button is clicked, close the custom dialog
		dialogButton.setOnClickListener(new OnClickListener() {
			@Override
			public void onClick(View v) {
				dialog.dismiss();
			}
		});

		dialog.setCanceledOnTouchOutside(false);

		dialog.show();

	}

	@Override
	public void onBackPressed() {

		Intent intent = new Intent(getApplicationContext(),
				JobsCategoriesActivity.class);
		intent.addFlags(Intent.FLAG_ACTIVITY_CLEAR_TOP);
		startActivity(intent);

	}

}
