package com.nakhl.behtarinentekhab.activity;

import java.sql.SQLException;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collection;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import roboguice.inject.InjectView;
import android.content.Intent;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.EditText;
import android.widget.Spinner;
import android.widget.TextView;

import com.google.inject.Inject;
//import com.j256.ormlite.logger.Log;
import com.nakhl.behtarinentekhab.R;
import com.nakhl.behtarinentekhab.model.dao.JobDao;
import com.nakhl.behtarinentekhab.model.dao.LevelDao;
import com.nakhl.behtarinentekhab.model.entity.Exercise;
import com.nakhl.behtarinentekhab.model.entity.Job;
import com.nakhl.behtarinentekhab.model.entity.Level;

public class Model2ResultActivity extends FullScreenActivity {

	@InjectView(R.id.textViewResultType)
	private TextView tvType;

	@InjectView(R.id.textViewRezaiatActivities)
	private TextView tvRezaiatActivities;

	@InjectView(R.id.textViewJobs)
	private TextView tvJobs;

	@Inject
	private LevelDao levelDao;

	private Level level;

	@Inject
	private JobDao jobDao;

	// result of test - suitable jobs based on person shakhsiat!
	String suitableJobs = "";
	String ESFJ, ESTJ, ISFJ, ISTJ, ESTP, ESFP, ISFP, ISTP, ENTJ, ENTP, INTJ,
			INTP, ENFP, ENFJ, INFJ, INFP;
	String ESFJw, ESTJw, ISFJw, ISTJw, ESTPw, ESFPw, ISFPw, ISTPw, ENTJw,
			ENTPw, INTJw, INTPw, ENFPw, ENFJw, INFJw, INFPw;

	String personality;

	/*
	 * (non-Javadoc)
	 * 
	 * @see android.app.Activity#onCreate(android.os.Bundle)
	 */
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.activity_model2_result);

		tvType.setMovementMethod(new ScrollingMovementMethod());
		tvRezaiatActivities.setMovementMethod(new ScrollingMovementMethod());
		tvJobs.setMovementMethod(new ScrollingMovementMethod());

		initDescTexts();

		findType();
		setTypeResults();
	}

	private void setTypeResults() {

		if (personality.equalsIgnoreCase("ESFJ")) {
			
			tvRezaiatActivities.setText(ESFJ);
			tvJobs.setText(ESFJw);
		} else if (personality.equalsIgnoreCase("ESTJ")) {

			tvRezaiatActivities.setText(ESTJ);
			tvJobs.setText(ESTJw);
		} else if (personality.equalsIgnoreCase("ISFJ")) {

			tvRezaiatActivities.setText(ISFJ);
			tvJobs.setText(ISFJw);
		} else if (personality.equalsIgnoreCase("ISTJ")) {

			tvRezaiatActivities.setText(ISTJ);
			tvJobs.setText(ISTJw);
		} else if (personality.equalsIgnoreCase("ESTP")) {

			tvRezaiatActivities.setText(ESTP);
			tvJobs.setText(ESTPw);
		} else if (personality.equalsIgnoreCase("ESFP")) {

			tvRezaiatActivities.setText(ESFP);
			tvJobs.setText(ESFPw);
		} else if (personality.equalsIgnoreCase("ISFP")) {

			tvRezaiatActivities.setText(ISFP);
			tvJobs.setText(ISFPw);
		} else if (personality.equalsIgnoreCase("ISTP")) {

			tvRezaiatActivities.setText(ISTP);
			tvJobs.setText(ISTPw);
		} else if (personality.equalsIgnoreCase("ENTJ")) {

			tvRezaiatActivities.setText(ENTJ);
			tvJobs.setText(ENTJw);
		} else if (personality.equalsIgnoreCase("ENTP")) {
			
			tvRezaiatActivities.setText(ENTP);
			tvJobs.setText(ENTPw);
		} else if (personality.equalsIgnoreCase("INTJ")) {

			tvRezaiatActivities.setText(INTJ);
			tvJobs.setText(INTJw);
		} else if (personality.equalsIgnoreCase("INTP")) {

			tvRezaiatActivities.setText(INTP);
			tvJobs.setText(INTPw);
		} else if (personality.equalsIgnoreCase("ENFP")) {

			tvRezaiatActivities.setText(ENFP);
			tvJobs.setText(ENFPw);
		} else if (personality.equalsIgnoreCase("ENFJ")) {

			tvRezaiatActivities.setText(ENFJ);
			tvJobs.setText(ENFJw);
		} else if (personality.equalsIgnoreCase("INFJ")) {

			tvRezaiatActivities.setText(INFJ);
			tvJobs.setText(INFJw);
		} else if (personality.equalsIgnoreCase("INFP")) {

			tvRezaiatActivities.setText(INFP);
			tvJobs.setText(INFPw);
		}
	}

	private void initDescTexts() {
		String temp;

		// estp
		temp = "شخصیت های ESTP اشخاصی مطمئن و جالب هستند. دوست دارند با کسانی باشند که علایق و ماجراهای لذت بخش خود را با آنها در میان بگذارند. رفتاری جذاب و همه گیر دارند اما در ضمن می توانند صریح مستقیم و قاطع باشند. انرژی بیش اندازه دارند. پیوسته در تب و تاب و تلاش هستند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*مبتکر ، پر مایه و عمل گراهستند. دوست دارند با حقایق روبرو شوند. به شدت نتیجه گرا هستند . \n*در برخورد با مسایل از منطق استفاده می کنند . \n*می توانند حقایق مختلفی را درک و آنهارا به یاد بیاورند. \n*از اینکه در آخرین لحظه کارها را انجام بدهند لذت می برند . \n*زیر فشار بسیار خونسرد هستند . \n*می توانند موقعیت های پر فشار را نرم و ملایم بکنند. \n*رفتاری محکم و فشرده دارند. دنبال موفقیت و شناخت می گردند . \n*رقابت جو هستند و در بحران ها و گرفتاریها به هیجان می آیند.\n*تنها در صورتی مطابق مقررات رفتار می کنند که بتوانند به خواسته های خود برسند. \n*متقاعد کننده هستند و خودشان را به سرعت بالا می کشند. \n*اغلب چند پروژه را با هم انجام می دهند. \n*از مشاغل پر انرژی و پر استرس لذت می برند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*مستقل هستند و آزادی را دوست دارند. دوست ندارند کنترل شوند . \n*زیر فشار به سادگی احساس می کنند که گیر افتاده اند. \n*همیشه مترصد ماجراها و تجربه جدید هستند . \n*خوشبین هستند و وقت زیادی را صرف نگرانی و تاسف نمی کنند . \n*آشنایان زیادی دارند و با گروهای مختلف مردم به خوبی کنار می آیند. \n*علاقه چندانی به پرداختن به مباحث عاطفی و میان فردی ندارند.\n*دوست دارند شرکای زندگی بالقوه خود را تحت تاثیر جاذبه ، موفقیت و توانمندی خود قرار دهند . \n*در زمینه های مادی بسیار سخاوتمند هستند اما ممکن است کارهای مشخصی که برای ایجاد صمیمیت لازم است را فراموش کنند . \n*شادی و هیجان را به روابط خود می آورند.\n*تحت تاثیر تضاد و تعارض تحریک می شوند و به هیجان می آیند. \n*می توانند غیر قابل پیش بینی باشند. ممکن است عکس آنچه را که شما انتظار دارید انجام دهند و لزومی برای توجیه رفتارشان احساس نکنند.\n";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایESTP  دوست دارند که در کانون صحنه قرار بگیرند و داستان تعریف کنند و لطیفه بگویند. آنها از چیزهای خوب زندگی لذت می برند و وقت زیادی را صرف معاشرت های اجتماعی می کنند. دوست دارند ریسک بکنند و کارهای مخاطره آمیز انجام بدهند. از جمله ، از کوهنوردی ، اسکی ، شکار ، پرش با چتر نجات ، قایق رانی و موج سواری لذت می برند . روابط شخصی و صمیمانه برای آنها از اهمیت چندانی برخوردار نیست . آنها به رقابت ، فعالیت و ماجرا بهای بیشتری می دهند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*اگر می خواهید در محل کار مورد احترام دیگران واقع شوید به روش های استاندارد انجام کارها توجه کنید. \n*برای اینکه پروژه های شما با قبولی بیشتری مواجه شوند ، برنامه علمی بریزند و به بداهه کاری صرف توجه نداشته باشید . سر هم بندی نکنید. \n*به کارهای ناخوشایند اما مهم توجه کافی مبذول دارید. \n*مراقب باشید که دیگران را با قاطعیت و رک گویی بیش اندازه خود ناراحت نکنید. \n*سعی کنید با توجه کردن به دیگران سخاوت خود را نشان دهید. \n*«دوستت دارم» گفتن را فراموش نکنید. از دیگران تعریف و تحسین کنید. \n*آنقدر در پروژه های خود محو نشوید که دوستان و عزیزانتان را فراموش کنید . \n*به ارزش های والاتر توجه داشته باشید. \n*به اینکه اعمال و رفتار شما ، روی شما و دیگران چه تاثیری بر جای می گذارد، توجه کنید. \n*به خاطر داشته باشید که هیجان ، شیفتگی و تنوع همیشه برای کسانی که ثبات ، مداومت و قابلیت بیش بینی را ترجیح می دهند ، چیز جالبی نیست . \n*به تفاوت های دیگران بها بدهید و دیگران را در تصمیم گیری ها لحاظ کنید. \n*وقتی صرف کنید و ببنید کدام یک از تجارب شما ارزشمند ، پاداش دهنده و رضایت بخش هستند. \n*به جنبه های قوت خود توجه داشته باشند - واقع بین بودن ، علمی بودن ، داشتن ابتکار ، دوستانه بودن ، هوش ، فراست ، شادابی ، ماجراجویی و علمی بودن .\n";
		ESTP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*وکیل دعاوی\n*نجار\n*مربی\n*تحلیل گر سیستم های کامپیوتر\n*کارگر ساختمان \n*کارآگاه \n*تکنسین بخش اورژانس بیمارستان \n*مهندس \n*کارفرما\n*زارع\n*مامور آتش نشانی \n*مشاور مدیریت \n*مکانیک \n*پرسنل ارتش \n*نمایش دهنده\n*افسر پلیس\n*ورزش کار حرفه ای\n*واسطه ملک و املاک\n*نماینده فروش \n*واسطه اوراق بهادار و بورس \n*تکنسین \n*اپراتور حمل و نقل\n";
		ESTPw = temp;

		// enfj
		temp = "شخصیت هایENFJ  علاقمند و مهربان هستند و به کیفیات تحسین برانگیز دیگران توجه می کنند. آنها می توانند با اشخاص مختلفی در ارتباط باشند. ENFJ ها ارتباط برقرار کننده های عالی ، رهبرانی طبیعی و در انگیزه دادن و متقاعده کردن دیگران از مهارت فراوان بر خوردارند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*جاه طلب هستند . دوست دارند برای رسیدن به خواسته هایشان تلاش کنند .\n*آگاه ، منظم ، هدف گرا و قاطع هستند و از دیگران هم همین انتظار را دارند . \n*خود را به خوبی ابراز می کنند. در حرف زدن راحت هستند . \n*خوب متوجه می شوند که دیگران چه احتیاجی دارند .\n*به نظرات مختلف احترام می گذارند. در ایجاد روحیه گروهی بسیار موفق هستند . \n*دوست دارند با اشخاص خلاق و پر انرژی کار کنند و درگیر کارهای متنوعی بشوند .\n*از سیاست ها و و رویه ها تا جایی که با ارزش ها و نیازهای آنها منافات نداشته باشد استفاده می کنند. \n*وقتی به مشکلی بر خورد کنند آن را به عنوان یک چالش جدید می پذیرند . \n*مشاغلی را ترجیح می دهند که ایده آل های آنها را منعکس کند و به دیگران الهام و هماهنگی ببخشد. \n*دوست دارند اقدامات سریع انجام بدهند. اغلب در عجله و شتاب هستند و با کندی جریانات کار ، صبر و قرارشان را از دست می دهند .\n*دوست دارند در شرایط کنترل باشند و در قبال پروژه های خودشان مسئولانه عمل کنند.\n";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*دوستانه ، گرم و صمیمی هستند و دوست دارند دیگران را راضی کنند . \n*تلاش می کنند روابطی هماهنگ و تعاونی فراهم آورند. \n*دوستانی وفادار هستند. \n*می توانند شریک زندگی خود را آرمان سازی کنند و ناسازگاری ها را فراموش کنند. \n*دوست دارند اشخاص مورد علاقه شان در بهترین حد خود ظاهر شوند . \n*دوست دارند با تحسین شدن ، مورد احترام قرار گرفتن و تایید گردیدن از ارزش خود مطمئن شوند. \n*دوست ندارند بازخوردهای بد بدهند یا بگیرند . \n*اگر صحبت آنها مورد سوال و تردید قرار بگیرد ممکن است افسرده شوند. \n*بایدها و نباید های فراوانی دارند. \n*ممکن است نتوانند به راحتی با دنیای درون و احساسات خود کنار بیایند. \n*اغلب خود را مسئول احساسات دیگران می دانند . \n*میان رسیدن به خواسته های خود و کمک به دیگران برای آنکه به خواسته های خود برسند در تضاد هستند .";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت های ENFJ علایق فراوان دارند و دوست دارند که زندگی فعالی داشته باشند. آنها دوست دارند با دیگران باشند صرف وقت طولانی در تنهایی آنها را مکدر می کند. اوقات فراغت آنها برنامه ریزی شده است . آنها از خواندن ، صحبت کردن درباره ایده ها ، سازماندهی فعالیت ها و شرکت در سازمان های اجتماعی لذت می برند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*نخواهید که همه کارها را بکنید. بعضی از کارها را بعدا هم می توانید انجام دهید و بعضی از کارها اصولا می توانند انجام نشوند. \n*سعی کنید از میزان استرس خود بکاهید و به آنچه تاکنون به آن رسیده اید رضایت بدهید. \n*آرامش داشتن را بیاموزید.\n*به این توجه کنید که چه فعالیت هایی برای شما لذت بخش تر هستند. \n*مراقب آرمان سازی بیش از اندازه دیگران باشید. \n*سعی کنید به تایید دیگران وابسته نشوید. به آنچه خودتان به آن بها می دهید بیش تر توجه کنید. \n*بیاموزید که با تعارض ها روبه رو شوید. با آنکه شما می خواهید در شرایط هماهنگی بسر ببرید ، از روبه رو شدن با مشکلات طفره نروید. \n*بیش از اندازه نگران خواسته های دیگران نباشید. بدانید که شما نمی توانید همه خواسته های دیگران را بر آورده کنید .\n*بیاموزید به همان اندازه که از دیگران حمایت می کنید از آنها حمایت بخواهید . \n*مراقب باشید که در صحبت کردن خود چاپلوسی نکنید. \n*بیاموزید که توصیه و نصیحت بپذیرید ، تنها نصیحت نکنید .\n*زود هنگام تصمیم گیری نکنید. \n*به تفاوت احساسات واقعی خود و احساساتی که نشان می دهید توجه داشته باشید. \n*برای مهربانی ، پشتکار، گرمی، حساسیت ، خوش بینی ، همدلی ، رهبری و بینش و بصیرت خود ارزش قایل شوید .";
		temp += "\n\n" + ">> شکل ظاهری";
		temp += "\n"
				+ "شخصیت های ENFJ اغلب دست ها ، پاها و بالاتنه لاغری دارند . آنها در میان دوستان بسیار آرام و آهسته بنظر می رسند . با اینکه ENFJ هایی هستند که چابک به نظر می رسند ولی بیشتر وانمود به این امر می کنند .";

		ENFJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "* مشاور\n* روانشناس\n* مستشار\n* معلم\n* روحانی\n* نماینده فروش\n* منابع انسانی\n* مدیر\n* هماهنگ کننده رویدادها\n* سیاستمدار / دیپلمات\n* نویسنده\n";
		ENFJw = temp;

		// enfp
		temp = "شخصیت های ENFP معاشرتی ، پویا و شاداب هستند و خود به خودی دارند. اغلب از خلق و خوی خوبی بر خوردارند. اشتیاق آنها به زندگی می تواند مسری باشد. آنها از قوه تصور و تخیل فراوان بر خوردارند و ذهنی فعال دارند . روحیه شان پیوسته در حال تغییر است.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*بر رسیدگی به جزییات حتی در زمینه های مالی بی علاقه است . \n*دنبال تنوع و چالش هستند . پیوسته در این فکر هستند که روش تخیلی را برای انجام دادن کارهایشان انتخاب کنند . \n*می توانند رهبرانی با جذبه و الهام بخش باشند. آنها با انرژی و پشتکار خود به دیگران انگیزه می دهند. \n*دوست دارند با اشخاص خلاق و پر انرژی کار کنند. \n*برای آنها شروع کردن کار از تمام کردن آن اهمیت بیش تری دارد. \n*وقتی درگیر پروژه خود می شوند زمان و نیازهای جسمانی خود را فراموش می کنند . \n* می توانند روی پای خود بایستند و فکر کنند . \n*در بسیاری از زمینه ها با استعداد هستند اما در کم کردن حیطه توجه خود با دشواری رو به رو می شوند. \n*تحت تاثیر جزییات کلافه می شوند. ترجیح می دهند شخص دیگری به جزییات رسیدگی کند. \n*دوست دارند با سرعت خود کار کنند. می خواهند نظارت بر کار آنها کمترین مقدار ممکن باشد.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*می توانند پیوسته در اندیشه محبت و دوستی باشند. \n*برایشان مهم است که دیگران در چه شرایطی قرار دارند. \n*می توانند بلافاصله با دیگران روابط موثر بر قرار کنند. \n*توجه خود را به شخص دیگری جلب می کنند. می توانند کاری کنند که دیگران احساس کنند بی قید شرط دوست داشتنی هستند. \n*همسر خود را آرمان سازی می کنند. آنها همیشه درگیر و یا عاشق هستند . \n*برای آزادی و استقلال بهای فراوان قایلند. \n*دوست دارند احساسات خود را بیان کنند . \n*می خواهند خاص باشند. مترصد دریافت تایید و تصدیق از کسانی هستند که برایشان مهم می باشند. \n*می توانند جذاب و جلب کننده باشند . \n*با دیگران با گرمی و محبت برخورد می کنند . \n*می توانند به شدت با پشتکار ، مثبت و خوشبین باشند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایENFP  از اینکه داستان تعریف کنند لذت می برند . دوست دارند در کانون صحنه باشند و صحبت های معنی دار بکنند . دوست دارند در سمینار های آموزش و کلاس هایی که اشخاص مختلف در آن شرکت می کنند حضور داشته باشند. فعالیت های ساکت تر مانند کتاب خواندن ، نوشتن و پروژهای خلاق جملگی لذت بخش هستند ، اما دوست ندارند این را به مدت طولانی انجام دهند.  آنها دوست دارند زندگی فعال توام با خود به خودی داشته باشند و تجربه های جدید بکنند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*انرژیتان را با رفتن به جهات بیش از اندازه مختلف هدر ندهید. \n*محدودیت های خود را بشناسید و آنها را بپذیرید. \n*وقتی کاری را شروع آن را تمام کنید و بعد به سر وقت برنامه های جدید بروید. \n*اجازه ندهید برنامه های اجتماعی مورد علاقه شما مانع از آن شوند که به کارهای کم تر خوشایند اما مهم بپردازید. \n*تعهدی بدهید که عملی باشد . \n*تمرین کنید و پروژهای بزرگ را به اجزاکوچکتری تقسیم کنید و بعد همه تلاشتان را بکنید که کارتان انجام شود. \n*وقتی پروژه ای می کنید به این توجه کنید که به چه چیزهایی نیاز دارید. \n*برای خودتان کار کنید زیرا ممکن است فرد گرا و سرکش باشید . \n*از در گیر شدن در روابط جدید خودداری ورزید. وقتی صرف کنید و دیگران را بشناسید. \n*به این توجه کنید که با حرفتان روی دیگران چه تاثیری بر جای می گذارید. \n*تا زمانی از شما درخواست کمک نشده ، پیشنهاد کمک ندهید. \n*سریع ازدواج نکنید. به خود فرصتی بدهید تا قدری مسن تر شوید. \n*به خلاقیت ها ، خوش بینی ها ، فرد گرایی ، پشتکار ، خود به خودی ، ادراکی بودن ، کنجکاوی ، ابراز کننده بودن ، دوستانه بودن و سازگاری خود بها بدهید .";
		ENFP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*بازیگر \n*مدیر بخش تبلیغات \n*هنرمند \n*روحانی \n*برنامه ریز همایش \n*مشاور \n*آموزش دهنده گروه های شرکتی \n*سرگرم کننده \n*کار فرما \n*مسئول خدمات غذایی و شخصی \n*مسئول سلامت کل نگرا \n*متخصص توسعه منابع انسانی \n*طراح داخلی \n*روزنامه نگار \n*بازار یاب \n*متخصص رسانه ای \n*واسطه \n*سخنران الهام بخش \n*روان درمان گر \n*کارمند روابط عمومی \n*استخدام کننده \n*معلم دینی \n*مسئول فروش \n*مالک واحد های تجاری کوچک \n*آموزگار \n*نویسنده";
		ENFPw = temp;

		// entj
		temp = "شخصیت های ENTJ اشخاصی فعال ، پر انرژی ، مطمئن و با صلاحیت هستند. آنها طبیعتا به جاهایی می روند که بتوانند در آن مسئولیت داشته باشند و با استفاده از منابع به هدف های بلند مدت خود برسند. آنها اشخاصی با علم و اطلاع هستند. از مواجه استقبال می کنند. دوست دارند در بحث های روشنفکرانه شرکت کنند . آنها از اشخاصی که آنها را به مبارزه می طلبند استقبال می کنند و برای کسانی که این کار را نمی کنند احترامی قایل نیستند .";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*دوست دارند مسئول باشند ، اغلب مشاغل سرپرستی ، مدیریت و رهبری را بر عهده دارند . آنها مایل هستند که مسئول بهره برداری از توانایی های ویژه خود باشند .\n*رهبران موافق هستند. آنها برای رهبری و بنیان نهادن سازمان ها بسیار مناسب هستند . \n*موانع را به عنوان چالش در نظر می گیرند. آنها این توانایی را دارند که مشکلات سازمان را آشکارا شناسایی کرده و راه حل هایی ابتکاری برای کوتاه مدت یا بلند مدت ، بسته به نیاز سازمان ارائه کنند . \n*برای رسیدن به هدف هایشان به روشهای استراتژیک توجه می کنند. \n*حقایق و استراتژی ها را از قبل سازماندهی می کنند و دوست دارند که کارهایشان زودتر از زمان مقرر تمام شود. \n*عدم کارایی را دوست ندارند ، از نداشتن صلاحیت ، از نداشتن قاطعیت بیزارند. \n*رقابت جو هستند. اغلب معتاد به کار می باشند. \n*دوست دارند با اشخاص قوی ، مستقل و نتیجه گرا کار کنند. \n*بدون اینکه دلیل منطقی وجود داشته باشد تسلیم نمی شوند . \n*دوست دارند عهده دار امور باشند، تصمیم گیرنده باشند. مایل نیستند از دیگران دستورالعمل و راهنمایی بگیرند. مگر آنکه آن شخص از دانش و صلاحیت بیش تری بر خوردار باشد.\n*برای مسایل راه حل های منطقی ارائه می دهند. دوست دارند با دستورالعمل ها و راهنمایی های روشن و واضح کار کنند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*صادق ، صریح و رک هستند. آنها تعهداتی دارند و صریحا از این تعهدات حرف می زنند. \n*اشخاصی را که به آنها علاقه مند هستند تشویق می کنند که به شکلی که در نظر آنها از همه مناسب تر است فعالیت کنند . \n*با شور و اشتیاق زندگی می کنند . \n*خوش خلق و خوی و در مواقعی جدی هستند . \n*از روابط به عنوان فرصت مناسبی برای یادگیری استفاده می کنند . \n*به حیثیت و موقعیت بها می دهند. بعضی ها دوست دارند شریک زندگی ای داشته باشند تا آنها را در رسیدن به هدفهای زندگی شان یاری بدهد. \n*به همسری احتیاج دارند که خود مختار و از عزت نفس خوب برخوردار باشد. \n*وقتی کاری مطابق میل آنها انجام نمی شود صبر و شکیبایی خود را از دست می دهند . \n* می توانند مرعوب کننده ، صریح و مستقیم باشند. \n*می توانند جنبه های ملایم خود را پنهان کنند تا خشن و زبر به نظر برسند . \n* در شرایط استرس و فشار با خود و با دیگران رفتار پرخاش کننده دارند .";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت های ENTJ  برای هر کاری دنبال برنامه بهتری می گردند. مانند سایر شئونات زندگی ، تفریح و فراغت هم باید هدفی را جستجو کند. دوست دارند در برنامه هایی شرکت کنند که با اشخاص در تبادل سودمند قرار بگیرند. بعضی از آنها ترجیح می دهند کار را با تفریح ادغام کنند. مثلا با مشتریان خود هند بال بازی می کنند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*از تحت فشار گذاشتن دیگران، به اندازه ای خود تان را تحت فشار می گذارید خوداری ورزید. به خوب به اندازه کافی توجه کنید. بگذارید بعضی وقت ها کارها به شکلی که هستند باقی بمانند. \n*همه روزه فرصتی را به تفریح و استراحت اختصاص بدهید. از تکنیک های مراقبه یا کاستن از استرس استفاده کنید . \n*سعی کنید نیازهای عزیزانتان را پیش بینی کنید. از دیگران سوال کنید که برایشان چه می توانید انجام بدهید. \n*وقتی به خانه بر می گردید نیازتان به کنترل دیگران را کنار در بگذارید و وارد منزل شوید. \n*انتقاد را به حساب اینکه دیگران می خواهند شما را کنترل کنند نگذارید. اگر کسی شما را به مبارزه می طلبد ، قبل از اینکه واکنشی نشان دهید ببنید منظوری دارد. \n*متوجه تاثیر خود روی دیگران باشید. بیش از اندازه مطمئن ظاهر نشوید، پر خاشگری بیش از اندازه نداشته باشید. \n*به توصیه هایی از روی عقل سلیم ، توجه داشته باشید . وقتی بگذارید و اطلاعات تازه بدست آورید. قبل از تصمیم گیری به جنبه های مختلف توجه کنید.\n*از لحظه اکنون لذت ببرید. \n*توجه داشته باشید که هر کس استعدادی دارد. به استعدادهای دیگران به اندازه کافی توجه کنید . \n*بیاموزید که گهگاه مصالحه کنید و از در سازش بر آیید. مذاکره کنید تا همه به بخشی از خواسته های خود برسند. \n*به نقاط قوت خود توجه داشته باشید - اطلاعات وسیع ، سازمان یافته ، کار آمد ، عینی ، قاطع ، مطمئن ، نو آور و دارای مهارت های رهبری و برنامه ریزی.";
		temp += "\n\n" + ">> اطلاعات بیشتر";
		temp += "\n"
				+ "به عنوان یک ENTJ سبک اصلی زندگی شما در بیرون متمرکز شده است . جایی که شما با مسائل به طور معقولانه و منطقی برخورد می کنید .سبک ثانویه زندگی شما درون است جایی که شما مسائل را توسط بصیرت خود دریافت می کنید .\nشخصیت های ENTJ  رهبرانی مادرزاد هستند . آنها در دنیایی از احتمالات و امکانات زندگی می کنند ، آنجایی که می بینند همه انواع رقابت ها از میان برداشته می شود و آنها می خواهند شخصی باشند که بر مسائل فائق می آید و برنده می شود .\nآنها کشش زیادی به سمت رهبری دارند که به خوبی توسط سرعت فراگیری بالا، توانایی جذب زیاد اطلاعات علمی و قضاوت سریع و قاطع تغذیه می شود . آنها افرادی «مسئولیت پذیر » هستند .\nشخصیت هایENTJ  بسیار کار محور هستند و به طور کاملا طبیعی مناسب دنیای حقوقی و شرکتی می باشند .\nآنها محیط اطراف را بطور دائم برای مشکلات احتمالی که توانایی پیدا کردن راه حل برای آنها را دارا هستند ، بررسی می کنند .آنها عموما مسائل را از زوایای بسیار بزرگ می نگرند و اصولا در نقشه کشیدن برای حل کردن مسائل محیط اطراف - مخصوصا مسائل حقوقی و شرکتی - موفق هستند . آنها معمولا به دلیل میل شدید به رهبری ، در دنیای کسب و کار موفق هستند . آنها در تلاش شان در کار خستگی ناپذیر هستند . و گرایش به تصویرسازی از آینده سازمان دارند . به این دلایل آنها ذاتاً رهبران سازمانی هستند .در دنیای ENTJ ها جایی برای اشتباه وجود ندارد .آنها از تکرار اشتباهات خوششان نمی آید و در برابر بی کفایتی اصلا صبور نیستند . هنگامیکه به دلیل احترام سعی در صبر در این شرایط داشته باشند بسیار خشن می شوند .به دلیل آنکه آنها بطور ذاتی با احساسات مردم هماهنگ نیستند و بنظر می رسد که اعتقادی به هماهنگ کردن خود برای قضاوت با توجه به احساسات ، ندارند . ENTJ ها ، مانند خیلی از تیپ های دیگر ، مشکلاتی در مشاهده مسائل از دیدگاهی بجز دیدگاه خود دارند . برعکس تیپ های دیگر ، ENTJ ها ذاتاً صبر کمی در برابر افرادی که نگاهی متفاوت به زندگی دارند ، از خود نشان می دهند . ENTJ ها نیاز دارند که بطور آگاهانه بر روی شناسایی اهمیت نظرات دیگران مانند حساس بودن در برابر احساسات دیگران ، کار کنند . در فقدان این آگاهی ENTJ به شخصیتی مستبد ، هولناک و مغرور تبدیل می شوند . این می تواند یک مشکل واقعی برای ENTJ باشد .کسی که ممکن است از اطلاعات مهم و در عین حال همکاری دیگران بی بهره شود . در دنیای خصوصی این امر ممکن است بعضی از ENTJ ها را به همسران یا والدینی طاقت فرسا بدل کند .\nشخصیت های ENTJ  از میزان عظیمی از توان شخصیتی و حضور برخوردارند که به عنوان قدرتی برای دستیابی به هدف هایشان کار می کند . در عین حال این قدرت شخصیتی ، عاملی در جهت خود بزرگ بینی و از خود بیگانگی آنها نیز هست که ENTJ ها باید با فعالیت درست از این رخداد جلوگیری کنند . شخصیت هایی بسیار قوی و قاطع هستند . آنها تصمیمات را به سرعت می گیرند و بسیار سریع نظرات و تصمیمات خود را به دنیای اطراف ارائه می کنند . ENTJ هایی که بصیرت درونی خود را پرورش نداده باشند تصمیم هابشان را بسیار عجولانه و بدون فهمیدن همه موارد و راه حل ها می گیرند . \nاز طرف دیگر ، ENTJ هایی که طرف ذهنی و فکری خود را توسعه نداده باشند در منطق دادن به بینش خود ناتوان هستند و اصولا تصمیمات ضعیفی می گیرند . در این شرایط ممکن است ایده ها و بصیرت فوق العاده ای برای مسائل داشته باشند اما توان کمی برای تشخیص چگونگی عمل بر فراز دانسته ها داشته باشند یا عملکرد آنها نتایج متناقض حاصل کند .\nشخصیت ENTJ  ای که در محیطی کمتر از ایده آل پرورش یابد ممکن است به یک دیکتاتور یا خشن در دادن دستورات ناخودآگاه و بدون نیاز به توضیح منطقی و بدون در نظر گرفتن شرایط افراد دیگر که در آن سهیم هستند ، شوند .\nبا وجود این که ENTJ ها بطور ذاتی در مد احساسات دیگران نیستند ، ولی این اشخاص غالبا رگه های احساسی بسیار قوی ای دارند . اغلب این رگه های احساسی در ENTJ ها بسیار قوی هستند ولی آنها ظاهرا مایل هستند که این موارد را از دید دیگران مخفی نگه دارند و اعتقاد به ضعف احساسات دارند .\nبه دلیل عدم فعالیت ذاتی ENTJ ها در دنیای ارزش ها و احساسات ، ممکن است مواقعی آنها تصمیماتی که از روی ارزش می گیرند را در احساسات سرکوب شده خود به صورت بی اساس و نا مناسب نگه دارند که این خود گاهی باعث ایجاد مشکلات بسیار جدی برای آنها می شود .\nشخصیت های ENTJ از ارتباط با مردم لذت می برند . به عنوان برون گرا ، آنها در ابتدا از بیرون انرژی می گیرند و تحریک می شوند . برای ENTJ ها هیچ چیز لذت بخش تر و خرسند کننده تر از یک مکالمه با نشاط و رقابتی نیست . آنها بخصوص برای افرادی که در برابر آنها می ایستند و برای عقاید خود دلیل می آورند احترام قایل می شوند .";
		ENTJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "* مدیر یا موسس شرکت \n* مدیر عامل\n* مشاور رایانه\n* وکیل\n* قاضی\n* مدیر یا رئیس تجاری\n* استاد یا هیات مدیره دانشگاه";
		ENTJw = temp;

		// entp
		temp = "شخصیت هایENTP  افرادی پر انرژی ، با پشتکار و مطمئن هستند . به کار کردن علاقه زیاد دارند. نو آور هستند و می توانند راه های جدیدی برای انجام دادن کارها پیدا کنند. ENTP ها از توانمندی تحلیلی فراوانی برخوردارند و می توانند مسایل مختلف را حل و فصل کنند. آنها به تنوع و تغییر بها می دهند و در برابر آنچه آنها را کسل کند مقاومت می کنند .";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*از نبوغ و فکر بکر خود برای حل مسائلشان استفاده می کنند. \n*اشخاص با هوش و با تخلیل فراوان هستند و می توانند دیگران را متقاعد کنند تا نقطه نظر آنها را باور نمایند. \n*به روش های سنتی انجام دادن کارها بی علاقه اند . \n*اشخاصی الهام بخش هستند و به خاطر سریع الانتقال بودن ، اعتماد به نفس و اطمینانی که دارند و نیز به خاطر مهارت هایشان هواداران زیادی دارند . \n*به روش های سنتی انجام دادن پروژه ها بی توجهند، آنها دنبال روش های بدیع می گردند . \n* دوست دارند چند کار را با هم انجام دهند. اگر کار جالب نباشد خیلی زود مکدر می شوند . \n*دوست دارند با آدم های مختلفی در ارتباط باشند. \n*نمی توانند توجه خود را محدود کنند زیراموضوعات عدیده ای برای آنها جالب است.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*افرادی خوشبین هستند ، جذاب و جالب هستند و خوب صحبت می کنند . \n*برای آزادی و استقلال خود بهای فراوان قائلند. \n*سعی می کنند به جای داوری کردن درباره اشخاص آنها را بشناسند . \n*پیوسته در اندیشه آزمایش های جدید هستند. به محض اینکه ایده جدیدی مطرح می شود، می توانند دست به کار آن شوند . \n*دوست دارند شریک زندگیشان جالب و به لحاظ ذهنی تحریک کننده باشد و از تجربیات جدید و از ماجرا لذت ببرد . \n*می خواهند روابطشان پیوسته رشد کند. \n*می توانند خود بین ، اهل بحث و مباحثه و فاقد حساسیت باشند . \n*از بحث کردن لذت می برند. \n*میان تنها با خود کار کردن و معاشرت با دیگران تاب می خورند . \n*ممکن است منکر تالمات احساسی و عاطفی شوند. ممکن است سرشان را شلوغ نگه دارند تا احساسات خود را نا دیده بگیرند . \n*می توانند فاصله بگیرند و روابط خود را در شرایط سطحی حفظ کنند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "با توجه به علایق ، برنامه ها و ماجراهای زندگی ممکن است در نظر ENTP ها خیلی کوتاه باشد. آرامش و استراحت برای آنها انجام دادن کارهای جدید است. آنها از خنده و از در میان گذاشتن نظرات خود با دیگران لذت می برند. در خانه آنها به روی همه گشوده است. آنها از اینکه به نقاط مختلف و جالب سفر کنند لذت می برند. آنها به روی هر چه برایشان تفریحی باشد گشوده اند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*نیروی خود را در آن واحد صرف کارهای بیش از اندازه متنوع نکنید. فعالیت هایی را انتخاب کنید که برای شما از هر کار دیگری ارزشمندتر است. \n*زمانی راکه یک پروژه به آن احتیاج دارد حدس بزنید. هر زمانی را که بدست آمد آنرا دو برابر کنید . \n*سعی کنید با کسی متحد و دوست شوید که از پروژه مورد نظر شما لذت ببرد . \n*وقتی می خواهید ایده ای را ارائه دهید ، پیشاپیش خودتان را آماده کنید. این کار سبب می شود که برای پروژه های خود حمایت بیش تری بدست آورید. \n*توجه داشته باشید که نقطه نظرهای بیش از اندازه زیاد شما می تواند دیگران را خسته کند. بعضی ازآنها را برای خود حفظ کنید. \n*بیاموزید که در محدوده سیستم کار کنید . \n*کاری نکنید که فرصت و حواس شما نزد کارهای مختلف پخش شود. به فعالیت هایی که می تواند از شدت استرس شما بکاهد توجه کنید. \n*به خاطر داشته باشید که بحث کردن ، مشاجره نمودن برای بعضی ها تفریح به شمار می آید اما دیگران را می آزارد . \n*از قطع کردن صحبت دیگران خودداری ورزید. به مزایای گوش دادن توجه داشته باشید . \n*پاسخگو باشید. ضرب الاجل ها را جدی بگیرید. به زمان و وقت دیگران احترام بگذارید . به زمان دیگران و برنامه ریزی آنها بها بدهید. \n*آرام بگیرید و به واقعیت های ساده و لذت های روز های زندگی که در پیرامون شماست توجه بکنید. وقتی کار دیگری ندارید بکنید برای خودتان وقت ایجاد کنید. \n*بیاموزید که تالم عاطفی و احساسات منفی خود را بپذیرید. اینها بخش های طبیعی از زندگی هستند . \n*به توانمندی های خود بها بدهید - با پشتکار ، شایسته ، با صلاحیت ، سازگار، نوآوری ، مبتکر ، کنجکاو و جدی .";
		ENTP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*بازیگر \n*مدیر تبلیغات \n*وکیل\n*تحلیل گر کامپیوتر \n*مشاور \n*آموزش دهنده گروه های شرکتی \n*مهندس \n*کارفرما \n*برنامه ریز مالی \n*مخترع \n*بازار یاب \n*واسطه اوراق وثیقه \n*پزشک \n*روانشناس \n*کارمند روابط عمومی \n*سخنران \n*بازسازی کننده ساختمان های قدیمی \n*متخصص تحقیق و رشد و توسعه \n*فروشنده \n*دانشمند اجتماعی \n*استاد دانشگاه \n*نویسنده";
		ENTPw = temp;

		// esfj
		temp = "شخصیت هایESFJ  اشخاصی خون گرم ، معاشرتی و دوستانه هستند . به شدت اجتماعی هستند و وقتی از دیگران فاصله می گیرند بی قرار می شوند . دوست دارند که مورد نیاز باشند و از کارشان تشکر و قدردانی شود. آنها به نیازهای دیگران بیش از نیازهای خود بها می دهند . آنها به معیار های اجتماعی توجه دارند. آنها نگران جایگاه خود در جامعه هستند . آنها برای خود و دیگران باید ها و نباید های فراوانی دارند .";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*آگاه و هوشیار هستند ، سازمان یافته هستند و کارشان را انجام می دهند . \n*دوست دارند کارشان برنامه ریزی شده و به حالت روزمره درآید . \n*به جزئیات بها می دهند . دقت می کنند همه چیز با کارائی انجام شود. \n*بازیگران گروه خوبی هستند . دوست دارند همه کسانیکه با آنها همکار هستند در شمار دوستان آنها باشند. \n*دوست دارند تصمیم گیریها سریعا انجام شوند .اما نمی خواهند که همه تصمیمات را خودشان بگیرند. \n*اهل کمک و تعاون هستند ، خدمت گذار هستند و دوست دارند به دیگران کمک کنند. \n*دوست ندارند بر اساس باورهای نظری و فلسفی تصمیم گیری کنند. \n*در بر خورد با دیگران گرم و صمیمی هستند. \n*بسیار معاشرتی هستند و دوست دارند کارهایی بکنند که دیگران در آن حضور داشته باشند. \n*دوست دارند در محیطی عاری از تضاد و تنش کار بکنند. دوست دارند به دیگران کمک کنند تا به شکلی هماهنگ به سمت هدف مشترک خود حرکت کنند. \n*خواهان مشاغل مدیریتی نیستند اما وقتی این مقام ها را به آنها بدهند از خود اهتمام فراوان به خرج می دهند. \n*به مقامات بالا دست احترام می گذارند و معتقدند که دیگران هم باید به مقدمات احترام بگذارند .";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*مهربان ، دلسوز و ملاحظه کار هستند . \n*تمایل زیاد به حرف زدن دارند. \n*به بهترین کیفیات اشخاص توجه می کنند و رفتار اشخاص مورد نظر خود را آرمان سازی می کنند. \n*به هماهنگی بها می دهند . دوست ندارند به کسی توهین کنند یا اشخاص را از خود نومید سازند. \n*ممکن است قدرنشاناس به نظر برسند. \n*دوست دارند که به شدت مورد توجه قرار بگیرند ، تائید شوند و به خاطر کارهایی که برای دیگران می کنند مورد تائید و تحسین واقع شوند . \n*دوست دارند مورد نیاز باشند ، اما در کار مراقبت کردن از دیگران زیر فشار قرار می گیرد. \n*اگر بفهمند کسی از کارشان انتقاد میکند ممکن است افسرده و کسل شوند و یا دیگران را سرزنش نمایند. \n*دوست دارند سنتها و آداب و رسوم را زنده نگهدارند. \n* می توانند بی انعطاف ، سختگیر ، خود مدار باشند و از کسانیکه نظراتشان را با آنها در میان نمی گذارند انتقاد نمایند .";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایESFJ  زندگی بسیار شلوغ و پری دارند. آنها میزبان های بسیار خوبی هستند و دوست دارند دیگران احساس خوبی پیدا کنند. برنامه های میهمانیهای آنها به خوبی برنامه ریزی شده است. به زمان و انرژی خود را صرف سازمانهای اجتماعی مورد احترام خود می کنند. صرف وقت کردن با دوستان و افراد خانواده برای آنها بسیار مهم است.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*بی جهت از اختلاف و تعارض فرار نکنید. \n*به جای اینکه فکر کنید چه باید بکنید ، به این توجه کنید که چه می خواهید بکنید. \n*سعی نکنید بلا فاصله هر مسئله را حل کنید. تعارض و اختلاف نظر لزوما چیز بدی نیست. می تواند به شما و به همه کمک کند تا رشد کنید. \n*از سرعت گام خود بکاهید ، فرصتی را به فکر کردن اختصاص بدهید. به کارایی بپردازید که توجه شما را به خود جلب می کند ، سوزن دوزی ، نجاری ، کارهای دستی . \n*به تفاوت میان احساسات واقعی خود و احساساتی که چون فکر می کنید مناسب تر هستند ، به آنها تظاهر می کنید توجه کنید . \n*خلاصه و مختصر حرف بزنید . \n*از انجام دادن کارهایی که با روحیه شما همخوانی ندارد خوداری کنید. \n*قبل از اینکه به کسی کمک کنید از او بپرسید که آیا به کمک شما احتیاج دارد . \n*سلطه جویی نکنید. برای رسیدن به خواسته خود از سلطه جویی استفاده نکنید. \n*وقتی خواسته مورد نظرتان برآورده نمی شود از سرزنش کردن با دیگران خودداری ورزید. \n*به جای اینکه همیشه از دیگران سوال کنید ، به خودتان اعتماد کنید. \n*به توانمندی های خودتان بها بدهید .";
		ESFJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*بانکدار \n*دفتردار \n*کارگر خدمات نظافتی \n*مربی \n*مشاور \n*دستیار دندانپزشک \n*مهماندار هواپیما \n*آرایشگر مو \n*مددکار بهداشتی \n*مدرس منابع انسانی \n*طراح داخلی \n*برنامه ریز کالا \n*پرستار \n*مدیر اداره \n*جسم درمانگاه \n*کارمند آژانس ملک و املاک \n*خدمتگذار مذهبی \n*کارگر رستوران \n*خورده فروش \n*منشی \n*مدد کار اجتماعی \n*آسیب شناس تکلم \n*آموزگار \n*بازار یاب";
		ESFJw = temp;

		// esfp
		temp = "شخصیت های ESFP دوستانه ، با نمک ، جذاب و اهل صحبت هستند .آنها به روابط خود بها و اهمیت می دهند. دست و دلباز هستند ، بدون اینکه انتظار متقابل داشته باشند ، خود به خودی دارند ، با نشاط هستند و از هر کاری که می کنند و از هرچه می بینند لذت می برند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*دوست دارند در فضایی مهیج با اشخاصی دوستانه و پر انرژی کار کنند . \n*با مردم رابطه خوبی و حسنه دارند. \n*تنوع را دوست دارند .مشاغلشان را به سرعت تغییر می دهند. \n*مرتب محیط را وارسی می کنند و به سرعت بر موقعیت حاکم می شوند. \n*برای برطف کردن تضاد و تعارض از مهارت فراوان بر خوردارند. می توانند به دیگران کمک کنند تا کار گروهی را به نمایش بگذارند. \n*کاردان هستند و از عقل سلیم بر خوردار می باشند. \n*دوست دارند که در اسرع وقت به راه حل برسند. \n*می توانند به خوبی به دیگران انگیزه بدهند تا تصمیم بگیرند و کار گروهی را تقویت کنند. \n*از کارهایی که بتوانند به دیگران خدمت کنند لذت می برند. \n*در بسیاری از مواقع تا آخرین لحظه صبر می کنند تا کاری را انجام بدهند. \n*اگر بدانند انجام دادن کاری چه مدت طول می کشد ، می تواند برایشان تولید مشکل کند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*بسیار راحت هستند و خود و دیگران را می پذیرند. \n*دیگران را سرگرم می کنند و از ناراحتی به دورشان می کنند. حاضر نیستند اخبار ناخوشایند را تحسین کنند. \n*بسیار پر حرارت هستند و انرژی فراوان دارند. \n*روابط را تفریحی و جالب ارزیابی می کنند . \n*از رنج کشیدن دیگران ناراحت می شوند . \n*با مهر و محبت خود دیگران را تحت الشعاع قرار می دهند. \n*می توانند تکانه ای ، بی قرار و غیر قابل پیش بینی باشند . \n*عمل کردن را به فکر کردن ترجیح می دهند. برای آنها تنها ماندن یا کاری صورت ندادن دشوار است .";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایESFP  همه چیز را به یک حادثه خوب تبدیل می کنند. آنها از میهمانی های بزرگ لذت می برند. از گرد هم آیی های بزرگ لذت می برند. دوست دارند که در آخرین لحظه کاری صورت دهند. خانه هایشان اغلب پر از مردم است. از موسیقی ، رقص ، غذا ، نوشیدنی ها و سرگرمی ها لذت می برند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*از کنار موقعیت های مسئله ساز به این امید که بالاخره می گذرند عبور نکنید. \n*از تصمیم گیری های عجولانه که ممکن است بعدا ار آن ناراحت شوید خودداری ورزید. \n*آنقدر خود را درگیر مسائل نکنید که مسئولیت های خود را هم فراموش کنید . \n*کارتان را نیمه کاره به این دلیل که کار جالب تری پیشامد کرده است را رها نکنید. \n*بیش از اندازه به مادیات برای رسیدن به خوشبختی بها ندهید. \n*به فکر سلامتی خود باشید. \n*از قبول کارها و وظایف مختلف در آن واحد خودداری ورزید. \n*با خود صرف وقت کنید و به ندای درون خود گوش فرا دهید . \n*به ارزش ها و هدف های خود توجه کنید تا به معنای زندگی خود پی ببرید. \n*به نقات قوت خود توجه داشته باشید - گرم و صمیمی بودن ، با نمک بودن ، پذیرا بودن ، جذاب بودن ، سازگاری داشتن، خوشبین بودن ، ماجراجویی ، سخاوتمندی ، دوستانه بودن ، همکاری داشتن و نشاط داشتن.";
		ESFP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*رام کننده حیوانات \n*مربی ورزش \n*طراح \n*متخصص رژیم های غذایی و تغذیه \n*مربی آمادگی های جسمانی \n*میهماندار هواپیما \n*جمع آوری کننده اعانه \n*دستیار پزشک \n*برنامه ریز مال التجاره \n*موسیقی دان \n*پرستار \n*شغل درمانگر \n*بازیگر صحنه \n*جسم درمانگر \n*افسر پلیس \n*ورزشکار حرفه ای \n*متخصص روابط عمومی \n*عامل ملک و املاک \n*فروشنده \n*مدد کار اجتماعی \n*هماهنگ کننده حوادث خاص \n*آموزگار \n*اپراتور حمل و نقل \n*مسئول آژانس مسافرتی \n*دامپزشک یا دستیار دامپزشکی";
		ESFPw = temp;

		// estj
		temp = "شخصیت هایESTJ  از اینکه مسئولیتی داشته باشند و همه چیز را در کنترل خود داشته باشند لذت می برند . این اشخاص دوست دارند که مسئول باشند . در گرفتن تصمیمات عینی خوب عمل می کنند. آنها می دانند که چگونه کارها را انجام دهند . آنها درباره هر موضوعی عقیده ای دارند و همیشه از کلمه مناسب استفاده کنند .";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*در سازمان دادن به روش ها ، سیاستها و فعالیتها عالی عمل می کنند. \n*از زمان و منابع به شکل موثر استفاده می کنند تا نتایج فوری و ملموس بگیرند. \n*برای حل مسئله ، رسیدن به نتیجه و پیشرفت آماده اند . \n*از دیگران انتظار دارند از خود صلاحیت نشان دهند . \n*به خوبی آنچه را که غیر منطقی است درک می کنند. \n* دوست دارند که ریسکهای حساب شده بکنند. \n*محیط باثبات و قبال پیش بینی را دوست دارند . اما محیطشان پر از انواع آدمها است . \n*در بهترین حالت سخت گیر ، محکم اما منصف اند. \n*می تواند سخت گیر و متوقع باشند. \n*به کسانی که برابر آنها می ایستند احترام می گذارند ، به شرط آنکه آنها واقعیت ها را بشناسند ، از قوانین اطلاع داشته باشند و مایل باشند در برابر کارهایشان مسئولیت را بپذیرند. \n*معتاد به کار هستند و تلاش فراوان می کنند. \n*ممکن است برای رسیدن به خواسته های خود دیگران را پایمال کنند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*دوست دارند به آنها مسئولیت داده شود و نقش مشاور رابازی کنند. \n*آماده اند که از خود گذشتگی کنند تا پایبند تعهدات خود باقی بمانند. \n*بعد ازاتمام کارشان می توانند بسیار تفریحی و سرگرم کننده باشند. \n*از بسر بردن اوقات خود با خانواده و دوستانشان لذت می برند . \n*ممکن است ساختار ، نظم و اراده خود را بر همه تحمیل کنند . معتقدند که راهشان بهترین است . \n*صریح ، صادق و رک هستند. \n*می توانند نا شکیبا باشند . ممکن است از شنیدن نظرات دیگران با دشواری روبرو باشند. \n*ممکن است در کار درک احساسات خود و دیگران با دشواری روبرو باشند. \n*ظاهر سختی دارند اما درونشان لطیف و ملایم است و با کسانی که به آنها اعتماد کنند بسیار ملایم هستند. \n*دوست دارند برای افراد خانواده و برای سلامتی آنها ، اوراق بهادر و بیمه تهیه کنند. \n*موفقیت و خوشبختی خود را با توجه به کارهایی که در دنیای واقعی انجام می دهند می سنجند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت های ESTJ  دوست دارند اوقات فراغت خود را به شکل مولد و سازنده بگذارنند. آنها کارها را انجام می دهند.فعالیت هایی که کار را با برنامه های اجتماعی ترکیب می کنند ، مانند گلف بازی کردن با همکاران تجاری و اداری برای آنها بسیار جالب توجه است . بسیاری از ESTJ ها مسئول سازمآنهای خدمات اجتماعی و فعالیت های داوطلبانه و خیریه هستند . آنها با خوشحالی زمان خود را صرف کارهایی می کنند که آنرا باوردارند. آنها در ضمن از تفریح کردن با دوستان و افراد خانواده و از لطیفه گفتن با آنها لذت می برند.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*به نقطه نظر دیگران گوش فرا دهید. \n*راه حلهای برنده - برنده پیدا کنید. \n*تلاشهای دیگران را تائید کنید و به آنها ارزش بدهید. \n*به کارهایی که به درستی انجام می شوند مهر تائید بزنید. تنها به چیزهایی که باید اصلاح شوند اشاره بکنید. \n*با کسانی معاشرت کنید که که به روش مستقیم و صریح شما احترام بگذارند و از شما مرعوب نشوند. \n*محدودیتهای واقع بینانه برای خود و دیگران در نظر بگیرید. بیاموزید که بقدرکافی خوب است یعنی چه . \n*از دیگران به همان اندازه که خودتان کار می کنید ، کار بکشید. \n*به دیگران نگوئید چه باید بکنید و چه باید بکنند. فرض را بر این نگذارید که شما می دانید بهترین کار کدام است . \n*به دل و هراسهایتان توجه کنید . تنها به خشمتان توجه ننمائید. \n*راههایی بجوئید که خلق و خوی خود را کنترل کنید و اگر می خواهید از روی ناشکیبایی حرفی بزنید متوجه حرف زدنتان باشید . از اتاق بیرون بروید و هر گاه عصبانیتتان فروکش کرد باز گردید . \n*از کنترل کردن دست بردارید و ارام بگیرید . به مرخصی بروید و کارهایتان را در منزل به حال خود رها کنید . \n*به نقاط قوت خود توجه داشته باشید - واقع بینی ، توجه به جنبه های علمی ، عینی بودن ، منطقی بودن ، راستی ، احساس مسئولیت ، قابل اتکا بودن ، ناسازگاری ، مداومت و توانایی سازمانی .";
		ESTJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*مدیر مدرسه \n*وکیل \n*بازپرس \n*کارمند بانک \n*برنامه نویس کامپیوتر \n*کارگر ساختمان \n*دندانپزشک \n*برقکار \n*مهندس \n*مدیر مالی \n*پیمانکار \n*کارمند دولت \n*عامل بیمه \n*مدیر \n*مکانیک \n*افسر یا مامور ارتش \n*پزشک \n*افسر پلیس \n*واسطه املاک \n*نماینده فروش \n*واسطه اوراق بهادر \n*سرپرست \n*آموزگار";
		ESTJw = temp;

		// infj
		temp = "شخصیت های INFJ ساکت ، مهربان ، متوجه و قلبی رقیق دارند. شخصیت پیچیده آنها اغلب اسباب حیرت دیگران را فراهم می سازد. این تیپ شخصیتی از تصور و تخیل غنی بر خوردار است و به احساسات و انگیزه های دیگران بها می دهد. آنها به الهامات و ایده آل های خود وابسته هستند و به دیگران نیز رشد و فراست می بخشند .";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*به شدت بکر و خلاق هستند . \n*برای دستیابی به هدف های بلند مدت خود کار می کنند. می خواهند ببینند که نقطه نظرهای شان صورت تحقق پیدا می کند و به کار بسته می شود. \n*می توانند از خود و دیگران به شدت متوقع باشند. اغلب کمال طلب هستند . \n*در دفاع از ارزش ها و با ورهای خود بسیار راسخ هستند . \n*از ایده آل ها و هدف هایشان حمایت می کنند . \n*اغلب به رفاه مردم کمک می کنند. \n*ناکامی ها را مسائلی می دانند که باید حل و فصل شوند. \n*در استفاده از کلمات بسیار دقیق هستند . \n*درباره مسائل به طور دقیق فکر می کنند. در تمرکز کردن قوی هستند. از پرت شدن حواس خوششان نمی آید. \n*ترجیح می دهند در مکان هایی بی سرو صدا و سازمان یافته کار کنند. \n*خواهان تحسین و احترام هستند اما دوست ندارند که توجه دیگران را به خود جلب کنند . \n*می توانند رهبرانی مجاب کننده و الهام بخش باشند. \n*دوست دارند اوقات خود را سازمان دهی کنند و روی فرایند محصول کنترل داشته باشند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*آرام و دل نازک هستند . \n*دوست دارند خانه راحتی داشته باشند. \n*می توانند بسیار صمیمی باشند. ممکن به خاطر نیازهای شریک زندگیش تن به هر کاری بدهند. \n*شنونده خوبی هستند . \n*احساسات ، عواطف و محبت های خود را با شمار کوچکی ازدوستانشان در میان می گذارند . \n*اغلب خود را در قبال احساسات دیگران مسئول می داند و نمی توانند حد و مرز سالمی را رعایت کند. \n*می تواند روحیه متلون داشته باشد. \n*نسبت به انتقاد بسیار حساس است و اگر او را درک نکنند. به شدت رنجش به دل می گیرد. \n*در بیان اندیشه های خود با دشواری رو به روست . \n*می تواند دلی نازک داشته باشد. \n*نیازمند هماهنگی است و وقتی به این هماهنگی نرسد رنجش به دل می گیرد . \n*وقتی لازم با شد با کسانی مواجه شود مودبانه رفتار می کند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایINFJ  اعتقاد به تعادل بین صرف وقت به تنهایی (به منظور رسیدگی به پروژه های خلاق) و صرف وقت با دوستان و افراد خانواده خود دارند. برای آنها وجود یک خانواده خوشایند بسیار مهم است. بسیاری از INFJ ها از شرکت در مناسسبت های فرهنگی و هنری لذت می برند. آنها کارهای ذهنی را بیش از کارهای جسمانی دوست دارند.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*به زمانی که برای تنها بودن ، در خیال شدن ، بررسی تئوری ها و خواندن و خلق کردن احتیاج دارید احترام بگذارید. \n*نقطه نظرها ، پنداره ها ف احساسات و غنای درون خود را با نزدیکانتان سهیم شوید. \n*در ارتباط خود صریح و مستقیم باشید. \n*سعی کنید وقتی دیگران احتیاج دارند به آنها محبت کنید . \n*در اینکه به چه اندازه می توانید از دیگران قبولی و پذیرش بطلبید واقع بین باشید. \n*بیش از اندازه به خود را تحلیل نکنید. احساسات خود را از طریق نوشتن ، یا صحبت کردن ابراز نمایید. \n*روحیه خود را گذرا در نظر بگیرید. بدانید که روحیه تان تغییر خواهد کرد. \n*بی جهت وقت خود را صرف جزییات بیش از اندازه نکنید. تصمیم بگیرید چه کارهایی مفید است و چه فعالیت هایی را باید کنار بگذارید . \n*نخواهید که زندگی را کنترل کنید. بگذارید عالم هستی کار خودش را بکند. \n*از سرعت زندگی خود بکاهید. بیش از اندازه خودتان را تحت فشار قرار ندهید . \n*با کم وکاست های زندگی کنار بیایید. امور را به شکلی که هستند بپذیرید و نخواهید که همه چیز براساس ایده آل شما باشد. \n*دوستانی را انتخاب کنید که نظرات شما را درک کند و شما را تشویق کنند که خودتان باشید. \n*به نقاط قوت خود توجه داشته باشید - بینش فراوان ، ایده آلیست ، بکر ، خلاق ، مهربان ، صمیمی ، حساس ، وفادار ، سازمان یافته ، نو آور و مصمم .";
		INFJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*معمار \n*هنرمند \n*روحانی \n*مشاور \n*طراح \n*متخصص تغذیه \n*ویراستار \n*مسئول مراقبت های بهداشتی \n*پزشک کل نگرا \n*مفسر ، مترجم \n*کتابخانه دار \n*متخصص پزشکی \n*موسیقی دان ، آهنگساز \n*شغل درمان گر \n*فیلسوف \n*پزشک \n*طراح برنامه \n*روان و درمانگر \n*معلم دینی \n*پژوهشگر \n*دانشمند اجتماعی \n*آسیب شناس کلام \n*آموزگار و پروفسور \n*نویسنده";
		INFJw = temp;

		// infp
		temp = "شخصیت های INFP آرام ، راحت و تایید کننده هستند. آنها مطابق ارزش های درونی خود کار می کنند ، به روی ایده های نو گشوده اند اما اگر یکی از ارزش های اصلی آنها رعایت نشود ناراحت می شوند. داشتن تعصب و تعهد نسبت به آنچه به آن اعتقاد دارند بسیار ضروری است. آنها زندگی درونی قدرتمند و احساسات پیچیده دارند. گاه درک کردن INFP ها دشوار است زیرا احساساتشان اغلب درونی است از این رو نکات مهم خود با افراد کمی در میان می گذارد.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*از مقررات ، نظم ، رویه ، برنامه و سروقت بودن خوششان نمی آید. \n*نیازی به این ندارند که ارزش های خود را به دیگران تحمیل کنند. آنها ترجیح می دهند که به آرامی نظراتشان را با دیگران در میان بگذارند و آنها را متقاعد سازند. \n*آنها اغلب موفق و مصمم هستند و به روشی آرام برنامه های خود را دنبال می کنند . \n*اگر با گروهی باشند می توانند رهبری آنها را بدست بگیرند . \n*در شرایط رقابت آمیز ممکن است با مشکلاتی روبه رو شوند . \n*به استقلال و خود مختاری بها می دهند. از قطع شدن حواس خود خوششان نمی آید. دوست دارند هر کاری را که می کنند به نحو احسن انجام بدهند .\n*می توانند صبورانه کارهای سنجیده را انجام دهند . \n*می خواهند به خاطر کارشان مورد تشویق و تحسین قرار بگیرند . \n*خودشان را با معیارهای سطح بالا مقایسه می کنند . \n*از جوانب مختلف به مسایل نگاه می کنند ممکن است گاهی قاطعیت لازم نداشته باشند زیرا نمی دانند برای آنها چه چیزی اهمیت دارد . \n*اگر نتوانند هدف های خود را تحقق ببخشند ممکن است مایوس و دلسرد شوند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*به اصالت و عمق روابط بها می دهند . \n*وفادار و صمیمی هستند ، نسبت به دوستان وافراد خانواده خود متعهدند . \n*محطاط و ملاحظه کار هستند و با گروهای کوچک تر به راحتی بیش تری کنار می آیند. \n*می توانند سرگرم کننده باشند. \n*از این توانایی بر خوردارند که از دیگران مراقبت و آنها را تشویق و تایید کنند . \n*از کسانی که صرف وقت کنند تا رویاها ، هدف ها و الهامات آنها را درک کنند تشکر و قدر دانی می کنند . \n*اغلب به این دلیل که هم می خواهد در خلوت با خود باشد و هم علاقمند به معاشرت با دیگران هستند ، در تعارض می شوند . \n*به دیگران علاقمند و پر توجهند ، اما در مواقعی بی تفاوت به نظر می رسند. \n*یا در جریان کمک به دیگران غرق می شوند یا در بحر تحقق بخشیدن به رویاهای خود فرو می روند. \n*اغلب تصمیم نهایی خود را با دیگران در میان می گذارند . \n*می توانند نسبت به محیط خود حساس باشند ، صداهای بلند را دوست ندارند زیرا حواسشان را پرت می کند. \n*شریکی را برای خود می خواهند که با ارزش ها و هدف های آنها سهیم باشد . \n*در متعهد شدن محطاط عمل می کنند اما وقتی متعهد شدند، تعهدشان بلند مدت و پر دوام است .";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایINFP  ترجیح می دهند اوقات خود را به تنهایی صرف کنند. در ضمن دوست دارند با دوستان نزدیک خود به موزه ، سینما و یا به دامان طبیعت بروند. آنها از یاد گرفتن مطالب جدید لذت می برند. آنها به درک معانی زندگی علاقمند هستند.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*وقت بیش از اندازه صرف بررسی امکانات و احتمالات نکنید. به عمل و اقدام هم توجه داشته باشید. \n*راهی پیدا کنید تا به ایده ال های خود امکان ابراز بدهید. ارزش ها ، پنداره ها و عواطف خود رابا نزدیکانتان در میان بگذارید. \n*ریسک کنید خودتان و کارتان را به جهان عرضه نمایید. \n*به نیاز ها و خواسته های دیگران به بهای بی توجهی به خواسته ها و نیاز های خود توجه نکنید. \n*بیاموزید که حد مرزی در نظر بگیرید. بیاموزید که در مواقعی نه بگویید. \n*از مسامحه کردن اجتناب کنید. به ضرب الاجل ها توجه داشته باشید. \n*به تعهدات خود عمل کنید. مراقب کمال طلبی باشید. \n*به جای اینکه تنها به منابع خود اتکا کنید از دیگران هم کمک بگیرید. \n*وقتی مسئله ای دارید از یکی از دوستان خود بخواهید به حرف های شما گوش بدهد. اما تا وقتی حرفتان را تمام نکرده اید راهنمایی نکند. \n*از کسانی که به آنها اعتماد دارید تقاضای کمک کنید. از انتظارات و توقعات بیجا دست بکشید. \n*وقتی تعارض بروز می کند ، اعتراض خود رابیان کنید. اگر مخالفت های خود را روی هم انباشت کنید روزی می رسد که منفجر شود . \n*به دیگران توصیه و آرامش بدهید. \n*به ارزش های خود بها بدهید و بر اساس آنها تصمیم گیری کنید. \n*به نقاط قوت خود و از جمله به آرمان گرایی ، همدلی ، خلاقیت ، حساسیت ، فکر کردن ، محبت کردن ، بکر بودن ، سازگاری و کنجکاوی خود بهای لازم را بدهید .";
		INFP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*بازیگر \n*معمار \n*هنرمند \n*آهنگساز \n*مشاور \n*سردبیر، ویراستار \n*پزشک کل نگرا \n*مفسر ، مترجم \n*روزنامه نگار \n*کتابخانه دار \n*ماساژدرمانگر \n*موسیقی دان \n*حرفه درمانگر \n*عکاس \n*روان درمانگر \n*معلم دینی \n*نویسنده \n*پژوهشگر \n*دانشمند \n*دانشمند اجتماعی \n*آسیب شناس کلام \n*آموزگار";
		INFPw = temp;

		// intj
		temp = "شخصیت های INTJ الگوی ذهنی دارند که می گویند در شرایط چگونه باید باشد . آنها پیوسته برای بهبود خود ، دیگران و هر چیزی که در پیرامون آنها قرار دارد تلاش می کنند. نیاز فراوانی به استقلال دارند و افرادی به شدت مستقل می باشند. آنها دوست دارند کارها را به روش خود انجام دهند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "* از توانمندی های مفهومی و تصوری فراوان بر خوردارند. \n* اطمینان فراوانی به بینش های شمی خود دارند و می توانند آنها را به واقعیت برسانند. \n* اغلب به مقام رهبری و یا مدیریت در موسسه و شرکت می رسد و به سازمان خود احساسی از هدفمندی ، پنداره یا ماموریت می دهد. \n* به شکلی منطقی و منظم کار می کند تا راه حل هایی نوآور و مبتکرانه برای مسایل ایجاد کند . \n* سیستم ها و راه کارهایی تدارک می بیند که برای کاری که در دست دارد جالب است . \n* برای رسیدن به مقصود همان اندازه که به خود فشار می آورد به دیگران هم فشار می آورد. \n* وقتی واقعیت با الگوی آنها هم خوانی ندارد از خود انتقاد می کنند. \n* دوست دارد که مستقل کار کند ، دوست ندارد کسی در کار او دخالت کند. \n* دوست دارند بر اجرای عقاید خود کنترل داشته باشند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "* محطاط هستند. \n* بسیار صمیمی و با وفا هستند و بیش تر به روابط سنتی بها می دهند. \n* محبت خود را تنها به نزدیکان خود نشان می هند. \n* به معاشرت های دو نفری علاقمندند. \n* به تیپ های معاشرتی علاقمندند تا کمی از حالت جدی خود بیرون آيند. \n* به تبادل نظر و تبادل افکار علاقمندند. \n* از صحبت های خودمانی خوششان نمی آید . آنها دوست دارند از هر کاری که می کنند مطلبی بیاموزند. \n* نسبت به رد شدن و مورد بی اعتنایی قرار گرفتن حساس هستند اما رنجش خود را از دیگران پنهان می دارند. می خواهند کسی از آسیب پذیری آنها مطلع شود. \n* جذب و شیفته کارشان هستند و ممکن است به روابط خود بهای لازم را ندهند. \n* ممکن است روی نظر های خود سماجت به خرج دهند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "دوست دارند که به تنهایی صرف وقت کنند ، به تنهایی فکر کنند و چیز بخوانند و موضوعات جدید را مطالعه کنند. بسیاری از آنها سعی می کنند بدنشان را شاداب و سرحال نگه دارند تا بهتر بتوانند فکر کنند. آنها از ورزش های انفرادی مانند دویدن و شنا کردن خوششان می آید. از نظم و ترتیب خاص برخوردارند . اوقات فراغت آنها برنامه ریزی شده و هدف دار است . آنها از فعالیت هایی خوششان می آید که با آن بتوانند چیز یاد بگیرند.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "* با دیگران صحبت کنید و از آنها نظر بخواهید. \n* حق به جانب و تدافعی نباشید. نقطه نظرهای دیگران را رد نکنید. \n* به نشانه های جسمانی استرس ، قبل از اینکه حالت بحران پیدا کند توجه کنید . به محدودیت های خود توجه کنید و از سرعت گام خود بکاهید. \n* با توجه به توانمندی های دیگران از آنها تعریف و تمجید کنید . \n* اگر می خواهید با دیگران رابطه داشته باشید ، مراقب عدم حساسیت ها و انتقاد ها باشید. \n* در یک موقعیت منفی ، مسئولیت قسمت خود را بپذیرید. \n* بیاموزید که انعطاف پذیر باشید. \n* به کار کردن برای خود بها بدهید. بسیاری از INTJ ها به قدری مستقل هستند که نمی توانند برای دیگران کار کنند. \n* نخواهید که همه چیز زندگی را کنترل کنید. \n* به توانمندی های خود بها بدهید - نوآور بودن ، سازمان یافته بودن ، مصمم ، اعتماد به نفس ، استقلال و خودمختاری و توانایی درک پیچیدگی ها.";
		INTJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "* مدیر مدرسه \n* باستان شناس \n* ارشیتکت \n* فضانورد \n* وکیل \n* برنامه نویس یا تحلیل گر کامپیوتر \n* مشاور \n* طراح \n* اقتصاد دان \n* مهندس \n* مخترع \n* تحلیل گر سرمایه گذاری \n* مشاور مدیریت \n* ریاضی دان \n* واسطه وثیقه \n* عکاس \n* پزشک \n* روانپزشک \n* روان شناس \n* پژوهشگر \n* دانشمند \n* دانشمند اجتماعی \n* واسطه اوراق بورس \n* استاد دانشگاه \n* نویسنده";
		INTJw = temp;

		// intp
		temp = "شخصیت های INTP ساکت ، محطاط ، متکی به خود و به شدت مستقل هستند . برای آنها دقیق بودن ، مهم است . این تیپ شخصیتی از کنجکاوی فراوان بهره دارد.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*می توانند سیستم های پیچیده و الگوهای مفهومی را بهبود ببخشند ، اما ترجیح می دهند که کاربرد و اجرا را به دیگران واگذار نمایند . \n*از صلاحیت حرفه ای سطح بالا بر خوردارند و از این حیث به خود می بالند . \n*همه انتخاب هارا به دقت وارسی می کنند. \n*متوجه تضاد ها ، ناسازگاری ها و اشکالات منطقی در اندیشه های خود و دیگران هستند . \n*وقتی موضوعی را به درستی درک کنند به حرکت درمی آیند . \n*دوست دارند هدف ها و استانداردهای خود را در محیطی انعطاف پذیر و بی ساختار تعیین کنند. \n*اگر نتوانند از توانمندی های خود استفاده کنند ، بدبین و افسرده می شوند . \n*دوست دارند که به طور مستقل کار کنند ، اما تکمیل کردن کارها برایشان دشوار است. \n*دوست ندارند دیگران راسرپرستی کنند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*در اندیشه ها ، علایق و کار خود فرو می روند و ممکن است روابط خود را فراموش کنند . \n*نسبت به کسانی که برای آنها مهم هستند صمیمی و وفادارند. \n*ممکن است به آسانی از برقراری تماس با دیگران خودداری ورزند . \n*یک فضای رها از تضاد و آرام را دوست دارند. \n*به ظاهر جسمانی خود توجهی ندارند . برایشان مهم نیست که دیگران درباره آنها چه فکر می کنند. \n*خوش خلق هستند . \n*با غریبه ها رسمی هستند و از آنها فاصله می گیرند . \n*از صحبت های خودمانی خوششان نمی آید. \n*می توانند خود بین و خود خواه باشند. \n*اغلب از شرکای زندگی معاشرتی استقبال می کنند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت های INTP ترجیح می دهند که بسیاری از کارها را به تنهایی انجام دهند . آنها دوست دارند کارهایی بکنند که دیگران در آن دخالتی نداشته باشند . برخی از INTP ها از چالش های جسمانی لذت می برند و بسیاری از آنها به فعالیت هایی مانند بریج ، شطرنج و بازی با کلمات علاقمند هستند. آنها ، یاد گیرنده هایی برای همه مدت عمر هستند و پیوسته شعور خود را بیشتر می کنند .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*به امیال و نیازهای دیگران حساس باشید . ببینید برای کسانی که شما به آنها بها می دهید چه موضوعی اهمیت دارد . \n*بیش از اندازه انتقاد گر نباشید. \n*بیاموزید که آنچه را می نویسید یا می گویید ساده سازی کنید تا دیگران بتوانند شما را درک کند. \n*از موفقیت های دیگران تعریف کنید ، از استعدادهایشان حسن جویی کنید . حتی برای جزیی ترین کارها از آنها تعریف کنید . \n*تصمیم گیری های خود را به بعد موکول نکنید. \n*بیاموزید که خودتان را بیش تر بیان کنید. توضیح بدهید که در درون خود چه احساسی دارید. \n*در بحث های گروهی حرفتان را بزنید ، حتی اگر اندیشه یا ایده ای ممکن است به نظرتان مسلم برسد. \n*وقتی با نظر شما مخالفت می شود رفتار تدافعی اتخاذ نکنید. \n*به توانمندی های خود بها بدهید - نوآور بودن ، منطقی بودن ، مستقل بودن ، تحلیل گرا بودن ، توجه داشتن به جنبه های فطری و دقت در اندیشیدن و به زبان جاری ساختن .";
		INTP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*باستان شناسی \n*معمار \n*هنرمند \n*فضانورد \n*وکیل \n*زیست شناس \n*شیمی دان \n*تحلیل گر یا برنامه نویس کامپیوتر \n*مهندس \n*برنامه نویس مالی \n*طراح گرافیک \n*تاریخ دان \n*مخترع \n*ریاضی دان \n*موسیقی دان \n*فیلسوف \n*عکاس \n*پزشک \n*روانپزشک \n*روانشناس \n*پژوهشگر \n* دانشمند \n*استاد دانشگاه \n*نویسنده";
		INTPw = temp;

		// isfj
		temp = "شخصیت هایISFJ   اشخاصی متعهد ، قابل اتکا و صمیمی هستند . آنها معمولا ساکت ، محتاط و فروتن می باشند. دوست دارند که خدمت کنند. سعی می کنند که مفید واقع شوند . آنها به شکلی که قرار است رفتار می کنند و روال و رویه های کاری از مورد سوال قرار نمی دهند. واقع گرا ، علمی و آگاه می باشند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*به جزیات توجه ویژه دارند. دقیق و علاقمند به حقایق هستند . \n*سعی می کنند همه کارها را عالی انجام دهند ، اشتباهات کوچک برایشان نابخوشنودی است. \n*محطاط هستند . تمام تلاش خود را می کنند تا کارشان راانجام دهند. \n*از همکاران و کارکنان زیر دست خود حمایت می کنند. \n*در دستور دادن ، رک بودن و کمک خواستن مشکل دارند . \n*ترجیح می دهند که پشت صحنه کار کنند. دوست ندارند به چشم بیایند. \n*دوست دارند کارهایی بکنند که نتایج ملموس و مشخص بدست دهد. \n*اولویتهای خود را به دقت انتخاب می کنند و قبل از شروع به کار جدید اقدامات لازم را انجام می دهند. \n*دوست دارند به نهاد و موسسه ای که برایش کار می کنند احترام بگذارند . \n*مصمم و به خود انگیزه دهنده هستند . \n*نیاز اندکی به سرپرستی دارند . از دیگران نمی خواهند کاری را که خود آنها می توانند بکنند انجام بدهند. \n*دوست ندارد کسی مزاحم کار کردن آنها بشود . \n*از تغییر پشت سر هم استقبال نمی کنند. دوست دارند که برای انجام دادن کارشان دستورالعمل های صریح و روشن وجود داشته باشد. \n*به مقامات مسئول احترام می گذارند و کسانیکه را که اینکار را نمی کنند، درک نمی کنند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*مهربان ، ملاحظه کار ، دوستانه و نسبت به احساسات دیگران حساس هستند. \n*به نیازهای دیگران توجه دارند. \n*دوست دارند زندگی را برای خانواده شان ، راحت و لذت بخش کنند . \n*به نظر ارام می رسند و دوست دارند همه چیز را تحت کنترل داشته باشند. \n*حوادث را به دید شخصی ارزیابی می کنند و دنیای درون سرشاری دارند . \n*ممکن است احساس کنند که دیگران از آنها سو استفاده می کنند. \n*میتوانند از روی احساس وظیفه با اشخاصی که احساس مسئولیت نمی کنند در رابطه باقی بمانند. \n*ممکن است احساسات و نیازهایشان را خود نگهدارند تا دیگران را ناامید نکنند. \n*می توانند به سرعت قضاوت و انتقاد کنند اما دقت می کنند که دیگران را نرنجانند. \n*ممکن است فقط امکانات منفی را ببینند ، می توانند بدبین شوند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایISFJ  به پیرامون و راحتی خود توجه دارند . آنها ازخانه خود لذت می برند و دوست دارند همه چیز سازمان یافته و مرتب باشد . آنها فعالیت های برنامه ریزی شده را دوست دارند . دوست دارند برای پروژهای خلاق خود زمانی را اختصاص بدهند . دوست دارند با دوستان نزدیک و با خانواده باشند. از صرف شام های سنتی و گرد هم آییهای خانوادگی لذت می برند. برای آنها در آرامش قرار گرفتن می تواند دشوار باشد زیرا فکر می کنند همیشه باید کار مولد و مفیدی انجام بدهند.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*به روابط بی تناسب و نامناسب خود با افراد بی مسئولیت و زیاده خواه پایان دهد. \n*با خود با محبت و توجه و مهر صحبت کنید. دست نوازش بر پشت خود بکشید. \n*منتظر آن نشوید که شخص دیگری به شما بگوید کارتان عالی بود. \n*با خود به تنهایی صرف وقت کنید. برای تفریحات خود برنامه ای بریزید . \n* به خود امکان اشتباه کردن بدهید. \n*درباره نیازهایتان صحبت کنید. آرزو و مسایل خود را با دوستانتان در میان بگذارید. بگذارید دیگران به شما کمک کنند. \n*وقتی صرف کنید و هدفهایتان را شناسایی کنید. با توجه به ارزش های درونی خود دست به انتخاب بزنید. \n*توجه داشته باشید که تنها یک راه درست برای زندگی کردن وجود ندارد . \n*از نگران شدن بیش از اندازه خودداری ورزید. \n*از قبول کارهای بیش از اندازه خودداری ورزید. نه گفتن را بیاموزید. \n*گهگاه عصبانی شوید. ممکن است احساس گناه کنید اما این می تواند به شما کمک کند . \n*موفقیت هایتان را دست کم نگیرید. درباره آنها حرف بزنید. \n*قدر توانمندیهای خود را بدانید - واقع بین بودن ، عمل گرا بودن ، آگاهی ، حساس بودن ، همدلی کردن ، وفاداری ، دوستانه بودن ، قابل تکیه کردن بودن و ملاحظه کار بودن.";
		ISFJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*دفتر داری \n*سرپرست کارمندان \n*اپراتور کامپیوتر \n*مشاور \n*متخصص رژیم غذایی \n*کارمند خدمات بهداشتی \n*کارگر منزل \n*کتابخانه داری \n*پرستار \n*مدیر دفتر \n*چشم پزشک \n*دستیار وکیل \n*دارو ساز \n*جسم درمانگر \n*مامور رسیدگی به امر زندانیان \n*مدرس علوم دینی \n*خرده فروش \n*منشی \n*مدد کار اجتماعی \n*آسیب شناس تکلم \n*آموزگار \n*دام پزشک";
		ISFJw = temp;

		// isfp
		temp = "شخصیت های ISFP افرادی راحت و دوست داشتنی هستند آنها معتقدند که زندگی کن بگذار که دیگران هم زندگی کنند. آنها اغلب ساکت ، محطاط ، محافظه کارو فروتن هستند. آنها در لحظه اکنون زندگی می کنند و زندگی را به صورت ساده دوست دارند. برای آنها روابط هماهنگ از درجه اهمیت فراوان بر خوردار است. این اشخاص صمیمی آرام و مهربان است و اغلب نیاز های دیگران را مقدم بر نیاز های خود محسوب می کنند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*آرمان گرا هستند. دوست دارند کارهای رضایت بخش انجام بدهند به شرط آنکه با ارزش های آنها سازگار باشد . \n*کمال طلب هستند. \n*کارکنانی همکار و صمیمی هستند. اگر به کاری که می کنند اعتقاد فراوان داشته باشند ، بسیار پر کار نشان می دهند . \n*دوست د ارند مفید باشند و از کمک کردن به دیگران برای افزودن بر مهارت های علمی لذت می برند. \n*انعطاف پذیر و سازگار هستند. دوست دارند با اشخاص به شکل تعاونی و هم کاری کار کنند. \n*در معرض قوانین بیش از اندازه احساس محدودیت می کنند. از ساختار های انعطاف ناپذیر دل خوشی ندارد. \n*از محیط هایی که در آن تعرض و تضاد میان شخص وجود نداشته باشد استقبال می کنند. \n*به آنچه در لحظه به آن احتیاج دارند توجه می کنند. \n*نیازی به کنترل کردن و رقابت کردن احساس نمی کنند. ترجیح می دهند که در پشت صحنه کار کنند. \n*می توانند در محیط کار خود لذت و شادابی را وارد کنند. \n*در شرایط اظطراری به خوبی عمل می کنند و با خود مهربانی را به محیط می آورند. \n*به خاطر نداشتن قاطعیت ، نداشتن سمت و جهت و انگیزه کلافه و ناراحت می شوند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*علاقه مند ، سخاوتمند ، غیرخود خواه ، صمیمی و مهربان هستند. \n*مستمعین خوبی هستند و به نیاز های دیگران می رسند. \n*می توانند موقعیت های دشوار را ساده کنند و در مواقع دشواری به کمک دیگران برسند. \n*بیش از آنکه با کلمات بازی منند با عمل محبت خودشان را نشان می دهند. \n*به دیگران توجه فراوان دارند ، اما ملاحظات خود برای خودشان حفظ می کنند . \n*به نظر آرام میرسد اما زیر این آرامش و صورت ظاهر با پیچیدگی هایی رو به روهستند. \n* انتقادات را شخصی می کنند و به دل می گیرند. اغلب خود را به خاطر رفتار دیگران سرزنش می کنند. \n*از برخورد و تضاد اجتناب می کنند ، مشروط بر اینکه ارزش عمیقا شکل گرفته ای در آنها مخدوش شود.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایISFP  کار پاره وقت را دوست دارند تا بتوانند کارهایی را که به راستی به آن علاقمند هستند دنبال کنند. که از جمله آنها می توانند به بودن با دوستان و خانواده اشاره کرد .آنها از فعالیت هایی که از دستان خود استفاده کنند لذت می برند که به عنوان مثال می توان به نقاشی کردن ، سوزن دوزی ، آشپزی و تعمیرات خانه اشاره کرد .";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*در زمینه هایی که برای شما مهم هستند ، بیش تر قاطعیت نشان دهید. \n*عقاید و احساسات خود را ابراز کنید و از گفتن «نمی دانم» ، «هر چه که تو بخواهی» و غیره خود داری ورزید. \n*اگر در کارتان ناموفق هستید ، شغلی پیدا کنید که ایده آل های شما را ابراز کند . برای تعیین اولویت های خود کمک بگیرید و بعد شروع به کار کنید. \n*گاه محبت خود را با کلامات بیان کنید. \n*درباره کسانی که فکر می کنید خیر و صلاح شما را می خواهند ، بررسی کنید. \n*طرح ها و پروژه های خود را ناتمام نگذارید. \n*کارهایتان را به بخش های کوچکتری تقسیم کنید. وقتی هر قسمت از کارتان را انجام می دهید به خود امتیازی بدهید. \n*به زمان توجه بیشتری بکنید. \n*به همان اندازه که با دیگران آرام و ملایم هستید ، با خودتان آرام و ملایم باشید. \n*از موفقیت های خود قدردانی کنید. \n*به توانمندی های خود بها بدهید - سازگار بودن ، آرام بودن ، ملاحظه کار و باوفا بودن ، همکاری کردن ، فهیم بودن ، خود به خودی داشتن و داشتن حساسیت نسبت به دیگران.";
		ISFP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*هنرمند ، نقاش \n*آرایشگر \n* گیاه شناس \n*نجار \n*منشی ، کارمند \n*اپراتور کامپیوتر \n*مشاور \n*رقصنده \n*دستیار دندانپزشک و پزشک \n*طراح \n*متخصص تغذیه و رژیم غذایی \n*کارگر کارخانه \n*کارگر خدمات غذایی \n*جنگل بان \n*باغبان \n*جغرافیادان \n*زیست شناس دریایی \n*مکانیک \n*پرستار \n*شغل درمانگر \n*چشم پزشک \n*چسم درمانگر \n*افسر پلیس \n*مسئول برنامه های تفریحی \n*منشی \n*آموزگار \n*دامپزشک یا دستیار دامپزشک";
		ISFPw = temp;

		// istj
		temp = "شخصیت های ISTJ به شدت با ثبات ، مسئول و قابل اتکا هستند . و به واقعیت ها و حقایق بهای زیاد می دهند. کم حرف هستند ، بیشتر در خودشان هستند . وقت شناس ، دقیق و منظم هستند . می توانند به خوبی تمرکز کنند. پرت کردن حواس آنها دشوار است.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*در به خاطر آوردن حقایق و واقعیتها عالی هستند. \n*برای دقت اهمیت فراوانی قایل هستند . \n* دقت می کنند که چیزی فراموش نشود . به شدت به جزئیات توجه دارند کارکنانی سخت کوش هستند. \n*با ماشین ها ، واقعیتها ، حقایق و اعداد ارقام بهتر از دیگران کار می کنند . \n*از به تنهایی کار کردن لذت می برند . از پرت شدن حواسشان ناراحت می شوند . \n*دوست دارند مقررات رعایت شود و کسانی را که از این قاعده منحرف شوند را تحمل نمی کنند . \n*روشها و مقررات را تحمل اما نمی توانند افراد را تحمل نمایند . \n*تمایل دارند که سخت گیری و بی انعطاف باشند. \n*از مشاغلی که لباس ، محیط اطراف و ظواهر امر مهم نیستند ، دوری می گزینند. \n*از بیحالی و رخوت و نابه سامانی خوششان نمی آید. \n* به کمک کار سخت ، بدست آوردن مدارک تخصصی و احترام به سازمان پیشرفت می کنند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*همسرانی که به شدت وفادار و پایبند به تعهدات خود هستند . حرفشان قولشان است و می توانید روی آن حساب کنید . \n*عشقشان را عملاًً نشان می دهند اشخاص مطمئن و قابل اتکا هستند . در مورد آنها ، عملشان نشان می دهد که در چه شرایطی به سر می برند. \n*ممکن است در نشان دادن احساس صمیمیت خود با دشواری روبرو باشند ، هر چند که محبتشان اغلب عمیق است . \n*می توانند معاشرتی و اجتماعی باشد. \n*متواضع و فروتن هستند. \n*به شدت عملگرا هستند. \n*در برابر تغییر مقاوم هستند و به راحتی نظر وعقیده خود را تغییر نمی دهند . \n*ممکن است به احساسات خود و دیگران بی توجه باشد و نتوانند به راحتی نیازهای متفاوت از نیاز های خود را درک کنند. \n*می توانند به سرعت از دیگران انتقاد و کارشان را داوری کنند. \n*دوست ندارند پولی راکه به سختی بدست اورده اند ، مفت از دست بدهند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "برای ISTJها آرام گرفتن و استراحت کردن دشوار است . در نظرآنها کارهای لذت بخش مولد و سودآور نیست .آنها دوست دارند اوقات خود را صرف کاری سود مند بکنند که درآمدی بدست دهد. مثلا کار کردن با یک کامپیوتر برای آنها اسباب مسرت می شود. آنها از اینکه در دل طبیعت باشند لذت می برند و متوجه بسیاری از جزئیات واقع در پیرامون خود می شوند. آنها سادگی را دوست دارند. از سرگرمیها و غذاهایی استقبال می کنند که اقتصادی و غیر تجملی باشد.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*سعی کنید با دیگران مذاکره کنید و دنیا را از زاویه دید آنها نگاه کنید. \n*دست کم هفته ای یک بار «دوستت دارم» را به زبان بیاورید. \n*بیش اندازه محطاط و بی انعطاف نباشید .بدانید که تنها یک روش درست برای انجام دادن کارها وجود ندارد. \n*از مباحثاتی که یک برنده و یک بازنده داشته باشد احتراز کنید. \n*گهگاه کارهای تکانه ای و از روی خود به خودی بکنید. گهگاه تنبل شوید . \n*بیشتر لطیفه بگوئید. \n*به احساسات خود و دیگران بهای بیشتری بدهید. \n*به نیازها واحساسات دیگران توجه کنید. \n*از دیگران بیشتر تشکر کنید . حتی از کوچکترین کارهای آنها قدر شناسی کنید. \n*وقتی را صرف استراحت و بازی کنید . از مرخصی های خود غفلت نکنید. \n*از توانمندی خود که می توانید منطقی ، مستقل ، قابل اتکا ، وظیفه مند ، منظم ، دقیق ، سخت کوش و درک کننده باشید سپاسگذاری کنید .";
		ISTJ = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*حسابدار \n*مدیر مدرسه \n*بازرس \n*بانکدار \n*کارگر خدمت نظافتی \n*برنامه نویس کامپیوتر \n*کارگر ساختمان \n* پیمانکار \n* دندانپزشک \n*کارآگاه \n* برق کار \n* مهندس \n* کارمند دولت \n*نماینده بیمه \n*حقوق دان \n*کتابخانه دار \n*مدیر \n*مکانیک \n*تکنسین پزشکی \n*متخصص چشم \n*اپتومتریست \n*داروخانه دار \n*پزشک \n*افسر پلیس \n*واسطه اوراق بهادر \n*آموزگار \n*تکنسین";
		ISTJw = temp;

		// istp
		temp = "شخصیت های ISTP افرادی ساکت و کنجکاو هستند که عقب می ایستند و تماشا می کنند. این اشخاص برای همه اسرارآمیز هستند. آنها افرادی مستقل هستند و بر اساس انتظارات دیگران رفتار نمی کنند. آنها اشخاصی عمل گرا هستند که دست به ریسک می زنند و از اینکه به استقبال چالش ها می روند به خود می بالند.";
		temp += "\n\n" + ">> محل کار";
		temp += "\n"
				+ "*به واقعیت های ملموس واقع در پیرامون خود بها می دهند . \n*به زمان توجه دارند. روی چیزهای غیر لازم وقت صرف نمی کنند. \n*ابهام را دوست ندارند. حوصله گوش دادن به جزییات غیر لازم را ندارند. \n*دوست دارند مسایل را حل و فصل کنند. ترجیح می دهند مسایل را به شکلی منظم و بر اساس نظم ترتیب حل و فصل نمایند. \n*تمایل دارند از کناره رویه و مقررات عبور کنند و به نتیجه برسند. \n*به اعتقاد آنها مقامات و سلسله مراتب در سازمان های کاری ضرورتی ندارند و در برابر آنها به شدت مقاوم هستند . \n*از سرپرستی کردن و سرپرستی شدن دل خوشی ندارند . \n*ترجیح می دهند به تنهایی کار کنند ، مگر آنکه کسی باشد که توانمندی اش به مراتب از آنها بیشتر باشد تا تمایل به همکاری با او را نشان دهند. \n*ترجیح می دهند در بحران آرام باشند. \n*می توانند با ابزار به راحتی کار کنند . \n*در زمینه های مورد علاقه به جزییات بها می دهند. می توانند به سرعت از داده های آماری به طور منطقی سود بجویند. \n*اگر کارشان با چالش پیوسته روبه رو نباشد از آن مکدر می شوند.";
		temp += "\n\n" + ">> ارتباط با دیگران";
		temp += "\n"
				+ "*نیاز چندانی به صحبت کردن و اجتماعی شدن ندارد. بیش تر ترجیح می دهند با عمل خود و نه صحبت، ارتباط بر قرار سازند. \n*عشق خود را به طور عملی نشان می دهند. آنها با کمک کردن ، لطف کردن و حل کردن مسایل دیگران توجه خود را به آنها نشان می دهند. \n*در برابر الزامات ، وظایف یا قول قرار ها مقاومت نشان می دهند. \n*دوست دارند با اشخاصی صرف وقت کنند که با علایق آنها سهیم باشند و یا به آنها آزادی عمل بدهند که مطابق خواسته های خود عمل کنند. \n*اغلب تنها هستند اما با اشخاصی که برای آنها مهم هستند بسیار صمیمی و وفادارند. \n*می توانند غیر قابل پیش بینی باشند. \n*ممکن است در زمینه مهارت های میان فردی با دشواری هایی روبه رو باشند. \n*می توانند انتقاد کننده به نظر برسند. زیرا به منطق و واقعیت ها توجه خاص دارند.";
		temp += "\n\n" + ">> اوقات فراغت";
		temp += "\n"
				+ "شخصیت هایISTP  از فعالیت های خطر ناک و پر اضطراب مانند مسابقات اسب دوانی ، گلایدینگ ، صخره پیمایی ، اسکی یا موج سواری لذت می برند . بسیاری از آنها از راه کارهای رقابت آمیز استقبال می نمایند. آنها دوست ندارند که تکدر خاطر پیدا کنند و کسل شوند. آنها نقاطی را که دوست نداشته باشند به حال خود رها می کنند اما نقاطی را که دوست دارند ، به شدت مرتب و منظم می کنند.";
		temp += "\n\n" + ">> پیشنهاد";
		temp += "\n"
				+ "*تنها به نتایج فردی فکر نکنید به هدف های بلند مدت تر هم بها بدهید. \n*به این توجه کنید که نقطه نظرهای دیگران می تواند امکاناتی فراهم آورد که تا کنون به آن فکر نکرده بودید. \n*به این فکر کنید که هر کس کاری را به شکلی انجام می دهد. راه های ساختار دادن به زندگی بسیار متعدد و متنوع است . به فراسوی اندیشه سیاه و سفید دیدن بروید. \n*قبل از اینکه اختلاف نظرهای خود را با دیگران مطرح کنید به وجود توافقی که با آنها دارید اشاره نمایید. \n*به نکات خوب دیگران اشاره کنید. تنها در مقام اصلاح دیگران نباشید. در صورت امکان از آنها تقدیر و تحسین کنید. \n*گهگاه حرف های محبت آمیز بزنید. بگذارید دیگران بدانند که آنها را هم برای شما مهم هستند. \n*برای روابط مهم خود وقت کافی در نظر بگیرید. \n*بیاموزید که احساسات خود را با دیگران در میان بگذارید. در برقراری ارتباط گشوده تر باشید. نظرات خود را به لحن آشکارتری مطرح سازید. \n*به جنبه های قوت خود توجه داشته باشید و قدر آنهارا بدانید - منطقی بودن ، خود به خودی داشتن ، عملی بودن ، مستقل بودن ، ماجراجو بودن ، عینی بودن ، واقع بین بودن و پر انرژی بودن.";
		ISTP = temp;
		temp = "مشاغل مناسب";
		temp += "\n"
				+ "*ویراستار ، سردبیر \n*نجار \n*مربی ، آموزش دهنده \n*برنامه نویس کامپیوتر \n*کارگر ساختمانی \n*دستیار دندانپزشک و پزشک \n*اقتصادان \n*مهندس \n*زراع \n*مامور آتش نشانی \n*زیست شناسی \n*مکانیک \n*مامور ارتش \n*دستیار وکیل \n*دستیار پزشک \n*افسر پلیس \n*کار گاه خصوصی \n*تعمیرات چی \n*تحلیل گر امنیتی \n*فلز کار \n*تکنیسین \n*اپراتور حمل و نقل";
		ISTPw = temp;

	}

	private void findType() {

		level = levelDao.queryForId(60);
		int temp = level.getScore();
		if (temp == 0)
			personality = "I";
		else
			personality = "E";

		level = levelDao.queryForId(61);
		temp = level.getScore();
		if (temp == 0)
			personality += "N";
		else
			personality += "S";

		level = levelDao.queryForId(62);
		temp = level.getScore();
		if (temp == 0)
			personality += "F";
		else
			personality += "T";

		level = levelDao.queryForId(63);
		temp = level.getScore();
		if (temp == 0)
			personality += "P";
		else
			personality += "J";

		tvType.setText(personality);
	}

	/* Menu */
	@Override
	public boolean onCreateOptionsMenu(Menu menu) {
		MenuInflater inflater = getMenuInflater();
		inflater.inflate(R.menu.main, menu);
		return true;
	}

	@Override
	public boolean onOptionsItemSelected(MenuItem item) {

		return super.onOptionsItemSelected(item);
	}

	@Override
	public void onBackPressed() {

		Intent intent = new Intent(getApplicationContext(),
				Model2LevelsActivity.class);
		intent.addFlags(Intent.FLAG_ACTIVITY_CLEAR_TOP);
		startActivity(intent);

	}
}
